/* automatically generated by rust-bindgen 0.56.0 */

#![allow(non_upper_case_globals)]
#![allow(non_camel_case_types)]
#![allow(non_snake_case)]
#![allow(dead_code)]
use std::os::raw;

pub const NVML_API_VERSION: u32 = 11;
pub const NVML_API_VERSION_STR: &'static [u8; 3usize] = b"11\0";
pub const NVML_VALUE_NOT_AVAILABLE: i32 = -1;
pub const NVML_DEVICE_PCI_BUS_ID_BUFFER_SIZE: u32 = 32;
pub const NVML_DEVICE_PCI_BUS_ID_BUFFER_V2_SIZE: u32 = 16;
pub const NVML_DEVICE_PCI_BUS_ID_LEGACY_FMT: &'static [u8; 17usize] = b"%04X:%02X:%02X.0\0";
pub const NVML_DEVICE_PCI_BUS_ID_FMT: &'static [u8; 17usize] = b"%08X:%02X:%02X.0\0";
pub const NVML_NVLINK_MAX_LINKS: u32 = 12;
pub const NVML_MAX_PHYSICAL_BRIDGE: u32 = 128;
pub const nvmlFlagDefault: u32 = 0;
pub const nvmlFlagForce: u32 = 1;
pub const NVML_GRID_LICENSE_BUFFER_SIZE: u32 = 128;
pub const NVML_VGPU_NAME_BUFFER_SIZE: u32 = 64;
pub const NVML_GRID_LICENSE_FEATURE_MAX_COUNT: u32 = 3;
pub const INVALID_GPU_INSTANCE_PROFILE_ID: u32 = 4294967295;
pub const NVML_VGPU_VIRTUALIZATION_CAP_MIGRATION_NO: u32 = 0;
pub const NVML_VGPU_VIRTUALIZATION_CAP_MIGRATION_YES: u32 = 1;
pub const NVML_VGPU_PGPU_VIRTUALIZATION_CAP_MIGRATION_NO: u32 = 0;
pub const NVML_VGPU_PGPU_VIRTUALIZATION_CAP_MIGRATION_YES: u32 = 1;
pub const NVML_DEVICE_ARCH_KEPLER: u32 = 2;
pub const NVML_DEVICE_ARCH_MAXWELL: u32 = 3;
pub const NVML_DEVICE_ARCH_PASCAL: u32 = 4;
pub const NVML_DEVICE_ARCH_VOLTA: u32 = 5;
pub const NVML_DEVICE_ARCH_TURING: u32 = 6;

pub const nvmlClocksThrottleReasonSyncBoost: u32 = 16;
pub const nvmlClocksThrottleReasonSwThermalSlowdown: u32 = 32;
pub const nvmlClocksThrottleReasonHwThermalSlowdown: u32 = 64;
pub const nvmlClocksThrottleReasonHwPowerBrakeSlowdown: u32 = 128;
pub const nvmlClocksThrottleReasonDisplayClockSetting: u32 = 256;
pub const nvmlClocksThrottleReasonNone: u32 = 0;
pub const NVML_NVFBC_SESSION_FLAG_DIFFMAP_ENABLED: u32 = 1;
pub const NVML_NVFBC_SESSION_FLAG_CLASSIFICATIONMAP_ENABLED: u32 = 2;
pub const NVML_NVFBC_SESSION_FLAG_CAPTURE_WITH_WAIT_NO_WAIT: u32 = 4;
pub const NVML_NVFBC_SESSION_FLAG_CAPTURE_WITH_WAIT_INFINITE: u32 = 8;
pub const NVML_NVFBC_SESSION_FLAG_CAPTURE_WITH_WAIT_TIMEOUT: u32 = 16;
pub const NVML_INIT_FLAG_NO_GPUS: u32 = 1;
pub const NVML_INIT_FLAG_NO_ATTACH: u32 = 2;
pub const NVML_DEVICE_INFOROM_VERSION_BUFFER_SIZE: u32 = 16;
pub const NVML_DEVICE_UUID_BUFFER_SIZE: u32 = 80;
pub const NVML_DEVICE_UUID_V2_BUFFER_SIZE: u32 = 96;
pub const NVML_DEVICE_PART_NUMBER_BUFFER_SIZE: u32 = 80;
pub const NVML_SYSTEM_DRIVER_VERSION_BUFFER_SIZE: u32 = 80;
pub const NVML_SYSTEM_NVML_VERSION_BUFFER_SIZE: u32 = 80;
pub const NVML_DEVICE_NAME_BUFFER_SIZE: u32 = 64;
pub const NVML_DEVICE_NAME_V2_BUFFER_SIZE: u32 = 96;
pub const NVML_DEVICE_SERIAL_BUFFER_SIZE: u32 = 30;
pub const NVML_DEVICE_VBIOS_VERSION_BUFFER_SIZE: u32 = 32;
pub const NVML_AFFINITY_SCOPE_NODE: u32 = 0;
pub const NVML_AFFINITY_SCOPE_SOCKET: u32 = 1;
pub const NVML_DEVICE_MIG_DISABLE: u32 = 0;
pub const NVML_DEVICE_MIG_ENABLE: u32 = 1;
pub const NVML_GPU_INSTANCE_PROFILE_1_SLICE: u32 = 0;
pub const NVML_GPU_INSTANCE_PROFILE_2_SLICE: u32 = 1;
pub const NVML_GPU_INSTANCE_PROFILE_3_SLICE: u32 = 2;
pub const NVML_GPU_INSTANCE_PROFILE_4_SLICE: u32 = 3;
pub const NVML_GPU_INSTANCE_PROFILE_7_SLICE: u32 = 4;
pub const NVML_GPU_INSTANCE_PROFILE_8_SLICE: u32 = 5;
pub const NVML_GPU_INSTANCE_PROFILE_COUNT: u32 = 6;
pub const NVML_COMPUTE_INSTANCE_PROFILE_1_SLICE: u32 = 0;
pub const NVML_COMPUTE_INSTANCE_PROFILE_2_SLICE: u32 = 1;
pub const NVML_COMPUTE_INSTANCE_PROFILE_3_SLICE: u32 = 2;
pub const NVML_COMPUTE_INSTANCE_PROFILE_4_SLICE: u32 = 3;
pub const NVML_COMPUTE_INSTANCE_PROFILE_7_SLICE: u32 = 4;
pub const NVML_COMPUTE_INSTANCE_PROFILE_8_SLICE: u32 = 5;
pub const NVML_COMPUTE_INSTANCE_PROFILE_COUNT: u32 = 6;
pub const NVML_COMPUTE_INSTANCE_ENGINE_PROFILE_SHARED: u32 = 0;
pub const NVML_COMPUTE_INSTANCE_ENGINE_PROFILE_COUNT: u32 = 1;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nvmlDevice_st {
    _unused: [u8; 0],
}
pub type nvmlDevice_t = *mut nvmlDevice_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nvmlPciInfo_st {
    pub busIdLegacy: [raw::c_char; 16usize],
    pub domain: raw::c_uint,
    pub bus: raw::c_uint,
    pub device: raw::c_uint,
    pub pciDeviceId: raw::c_uint,
    pub pciSubSystemId: raw::c_uint,
    pub busId: [raw::c_char; 32usize],
}
#[test]
fn bindgen_test_layout_nvmlPciInfo_st() {
    assert_eq!(
        ::std::mem::size_of::<nvmlPciInfo_st>(),
        68usize,
        concat!("Size of: ", stringify!(nvmlPciInfo_st))
    );
    assert_eq!(
        ::std::mem::align_of::<nvmlPciInfo_st>(),
        4usize,
        concat!("Alignment of ", stringify!(nvmlPciInfo_st))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlPciInfo_st>())).busIdLegacy as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlPciInfo_st),
            "::",
            stringify!(busIdLegacy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlPciInfo_st>())).domain as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlPciInfo_st),
            "::",
            stringify!(domain)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlPciInfo_st>())).bus as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlPciInfo_st),
            "::",
            stringify!(bus)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlPciInfo_st>())).device as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlPciInfo_st),
            "::",
            stringify!(device)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlPciInfo_st>())).pciDeviceId as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlPciInfo_st),
            "::",
            stringify!(pciDeviceId)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlPciInfo_st>())).pciSubSystemId as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlPciInfo_st),
            "::",
            stringify!(pciSubSystemId)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlPciInfo_st>())).busId as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlPciInfo_st),
            "::",
            stringify!(busId)
        )
    );
}
pub type nvmlPciInfo_t = nvmlPciInfo_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nvmlEccErrorCounts_st {
    pub l1Cache: raw::c_ulonglong,
    pub l2Cache: raw::c_ulonglong,
    pub deviceMemory: raw::c_ulonglong,
    pub registerFile: raw::c_ulonglong,
}
#[test]
fn bindgen_test_layout_nvmlEccErrorCounts_st() {
    assert_eq!(
        ::std::mem::size_of::<nvmlEccErrorCounts_st>(),
        32usize,
        concat!("Size of: ", stringify!(nvmlEccErrorCounts_st))
    );
    assert_eq!(
        ::std::mem::align_of::<nvmlEccErrorCounts_st>(),
        8usize,
        concat!("Alignment of ", stringify!(nvmlEccErrorCounts_st))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlEccErrorCounts_st>())).l1Cache as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlEccErrorCounts_st),
            "::",
            stringify!(l1Cache)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlEccErrorCounts_st>())).l2Cache as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlEccErrorCounts_st),
            "::",
            stringify!(l2Cache)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlEccErrorCounts_st>())).deviceMemory as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlEccErrorCounts_st),
            "::",
            stringify!(deviceMemory)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlEccErrorCounts_st>())).registerFile as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlEccErrorCounts_st),
            "::",
            stringify!(registerFile)
        )
    );
}
pub type nvmlEccErrorCounts_t = nvmlEccErrorCounts_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nvmlUtilization_st {
    pub gpu: raw::c_uint,
    pub memory: raw::c_uint,
}
#[test]
fn bindgen_test_layout_nvmlUtilization_st() {
    assert_eq!(
        ::std::mem::size_of::<nvmlUtilization_st>(),
        8usize,
        concat!("Size of: ", stringify!(nvmlUtilization_st))
    );
    assert_eq!(
        ::std::mem::align_of::<nvmlUtilization_st>(),
        4usize,
        concat!("Alignment of ", stringify!(nvmlUtilization_st))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlUtilization_st>())).gpu as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlUtilization_st),
            "::",
            stringify!(gpu)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlUtilization_st>())).memory as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlUtilization_st),
            "::",
            stringify!(memory)
        )
    );
}
pub type nvmlUtilization_t = nvmlUtilization_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nvmlMemory_st {
    pub total: raw::c_ulonglong,
    pub free: raw::c_ulonglong,
    pub used: raw::c_ulonglong,
}
#[test]
fn bindgen_test_layout_nvmlMemory_st() {
    assert_eq!(
        ::std::mem::size_of::<nvmlMemory_st>(),
        24usize,
        concat!("Size of: ", stringify!(nvmlMemory_st))
    );
    assert_eq!(
        ::std::mem::align_of::<nvmlMemory_st>(),
        8usize,
        concat!("Alignment of ", stringify!(nvmlMemory_st))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlMemory_st>())).total as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlMemory_st),
            "::",
            stringify!(total)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlMemory_st>())).free as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlMemory_st),
            "::",
            stringify!(free)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlMemory_st>())).used as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlMemory_st),
            "::",
            stringify!(used)
        )
    );
}
pub type nvmlMemory_t = nvmlMemory_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nvmlBAR1Memory_st {
    pub bar1Total: raw::c_ulonglong,
    pub bar1Free: raw::c_ulonglong,
    pub bar1Used: raw::c_ulonglong,
}
#[test]
fn bindgen_test_layout_nvmlBAR1Memory_st() {
    assert_eq!(
        ::std::mem::size_of::<nvmlBAR1Memory_st>(),
        24usize,
        concat!("Size of: ", stringify!(nvmlBAR1Memory_st))
    );
    assert_eq!(
        ::std::mem::align_of::<nvmlBAR1Memory_st>(),
        8usize,
        concat!("Alignment of ", stringify!(nvmlBAR1Memory_st))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlBAR1Memory_st>())).bar1Total as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlBAR1Memory_st),
            "::",
            stringify!(bar1Total)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlBAR1Memory_st>())).bar1Free as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlBAR1Memory_st),
            "::",
            stringify!(bar1Free)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlBAR1Memory_st>())).bar1Used as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlBAR1Memory_st),
            "::",
            stringify!(bar1Used)
        )
    );
}
pub type nvmlBAR1Memory_t = nvmlBAR1Memory_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nvmlProcessInfo_st {
    pub pid: raw::c_uint,
    pub usedGpuMemory: raw::c_ulonglong,
    pub gpuInstanceId: raw::c_uint,
    pub computeInstanceId: raw::c_uint,
}
#[test]
fn bindgen_test_layout_nvmlProcessInfo_st() {
    assert_eq!(
        ::std::mem::size_of::<nvmlProcessInfo_st>(),
        24usize,
        concat!("Size of: ", stringify!(nvmlProcessInfo_st))
    );
    assert_eq!(
        ::std::mem::align_of::<nvmlProcessInfo_st>(),
        8usize,
        concat!("Alignment of ", stringify!(nvmlProcessInfo_st))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlProcessInfo_st>())).pid as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlProcessInfo_st),
            "::",
            stringify!(pid)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlProcessInfo_st>())).usedGpuMemory as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlProcessInfo_st),
            "::",
            stringify!(usedGpuMemory)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlProcessInfo_st>())).gpuInstanceId as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlProcessInfo_st),
            "::",
            stringify!(gpuInstanceId)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlProcessInfo_st>())).computeInstanceId as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlProcessInfo_st),
            "::",
            stringify!(computeInstanceId)
        )
    );
}
pub type nvmlProcessInfo_t = nvmlProcessInfo_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nvmlDeviceAttributes_st {
    pub multiprocessorCount: raw::c_uint,
    pub sharedCopyEngineCount: raw::c_uint,
    pub sharedDecoderCount: raw::c_uint,
    pub sharedEncoderCount: raw::c_uint,
    pub sharedJpegCount: raw::c_uint,
    pub sharedOfaCount: raw::c_uint,
    pub gpuInstanceSliceCount: raw::c_uint,
    pub computeInstanceSliceCount: raw::c_uint,
    pub memorySizeMB: raw::c_ulonglong,
}
#[test]
fn bindgen_test_layout_nvmlDeviceAttributes_st() {
    assert_eq!(
        ::std::mem::size_of::<nvmlDeviceAttributes_st>(),
        40usize,
        concat!("Size of: ", stringify!(nvmlDeviceAttributes_st))
    );
    assert_eq!(
        ::std::mem::align_of::<nvmlDeviceAttributes_st>(),
        8usize,
        concat!("Alignment of ", stringify!(nvmlDeviceAttributes_st))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlDeviceAttributes_st>())).multiprocessorCount as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlDeviceAttributes_st),
            "::",
            stringify!(multiprocessorCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlDeviceAttributes_st>())).sharedCopyEngineCount as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlDeviceAttributes_st),
            "::",
            stringify!(sharedCopyEngineCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlDeviceAttributes_st>())).sharedDecoderCount as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlDeviceAttributes_st),
            "::",
            stringify!(sharedDecoderCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlDeviceAttributes_st>())).sharedEncoderCount as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlDeviceAttributes_st),
            "::",
            stringify!(sharedEncoderCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlDeviceAttributes_st>())).sharedJpegCount as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlDeviceAttributes_st),
            "::",
            stringify!(sharedJpegCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlDeviceAttributes_st>())).sharedOfaCount as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlDeviceAttributes_st),
            "::",
            stringify!(sharedOfaCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlDeviceAttributes_st>())).gpuInstanceSliceCount as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlDeviceAttributes_st),
            "::",
            stringify!(gpuInstanceSliceCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlDeviceAttributes_st>())).computeInstanceSliceCount
                as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlDeviceAttributes_st),
            "::",
            stringify!(computeInstanceSliceCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlDeviceAttributes_st>())).memorySizeMB as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlDeviceAttributes_st),
            "::",
            stringify!(memorySizeMB)
        )
    );
}
pub type nvmlDeviceAttributes_t = nvmlDeviceAttributes_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nvmlRowRemapperHistogramValues_st {
    pub max: raw::c_uint,
    pub high: raw::c_uint,
    pub partial: raw::c_uint,
    pub low: raw::c_uint,
    pub none: raw::c_uint,
}
#[test]
fn bindgen_test_layout_nvmlRowRemapperHistogramValues_st() {
    assert_eq!(
        ::std::mem::size_of::<nvmlRowRemapperHistogramValues_st>(),
        20usize,
        concat!("Size of: ", stringify!(nvmlRowRemapperHistogramValues_st))
    );
    assert_eq!(
        ::std::mem::align_of::<nvmlRowRemapperHistogramValues_st>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(nvmlRowRemapperHistogramValues_st)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlRowRemapperHistogramValues_st>())).max as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlRowRemapperHistogramValues_st),
            "::",
            stringify!(max)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlRowRemapperHistogramValues_st>())).high as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlRowRemapperHistogramValues_st),
            "::",
            stringify!(high)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlRowRemapperHistogramValues_st>())).partial as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlRowRemapperHistogramValues_st),
            "::",
            stringify!(partial)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlRowRemapperHistogramValues_st>())).low as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlRowRemapperHistogramValues_st),
            "::",
            stringify!(low)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlRowRemapperHistogramValues_st>())).none as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlRowRemapperHistogramValues_st),
            "::",
            stringify!(none)
        )
    );
}
pub type nvmlRowRemapperHistogramValues_t = nvmlRowRemapperHistogramValues_st;
pub const nvmlBridgeChipType_enum_NVML_BRIDGE_CHIP_PLX: nvmlBridgeChipType_enum = 0;
pub const nvmlBridgeChipType_enum_NVML_BRIDGE_CHIP_BRO4: nvmlBridgeChipType_enum = 1;
pub type nvmlBridgeChipType_enum = raw::c_uint;
pub use self::nvmlBridgeChipType_enum as nvmlBridgeChipType_t;
pub const nvmlNvLinkUtilizationCountUnits_enum_NVML_NVLINK_COUNTER_UNIT_CYCLES:
    nvmlNvLinkUtilizationCountUnits_enum = 0;
pub const nvmlNvLinkUtilizationCountUnits_enum_NVML_NVLINK_COUNTER_UNIT_PACKETS:
    nvmlNvLinkUtilizationCountUnits_enum = 1;
pub const nvmlNvLinkUtilizationCountUnits_enum_NVML_NVLINK_COUNTER_UNIT_BYTES:
    nvmlNvLinkUtilizationCountUnits_enum = 2;
pub const nvmlNvLinkUtilizationCountUnits_enum_NVML_NVLINK_COUNTER_UNIT_RESERVED:
    nvmlNvLinkUtilizationCountUnits_enum = 3;
pub const nvmlNvLinkUtilizationCountUnits_enum_NVML_NVLINK_COUNTER_UNIT_COUNT:
    nvmlNvLinkUtilizationCountUnits_enum = 4;
pub type nvmlNvLinkUtilizationCountUnits_enum = raw::c_uint;
pub use self::nvmlNvLinkUtilizationCountUnits_enum as nvmlNvLinkUtilizationCountUnits_t;
pub const nvmlNvLinkUtilizationCountPktTypes_enum_NVML_NVLINK_COUNTER_PKTFILTER_NOP:
    nvmlNvLinkUtilizationCountPktTypes_enum = 1;
pub const nvmlNvLinkUtilizationCountPktTypes_enum_NVML_NVLINK_COUNTER_PKTFILTER_READ:
    nvmlNvLinkUtilizationCountPktTypes_enum = 2;
pub const nvmlNvLinkUtilizationCountPktTypes_enum_NVML_NVLINK_COUNTER_PKTFILTER_WRITE:
    nvmlNvLinkUtilizationCountPktTypes_enum = 4;
pub const nvmlNvLinkUtilizationCountPktTypes_enum_NVML_NVLINK_COUNTER_PKTFILTER_RATOM:
    nvmlNvLinkUtilizationCountPktTypes_enum = 8;
pub const nvmlNvLinkUtilizationCountPktTypes_enum_NVML_NVLINK_COUNTER_PKTFILTER_NRATOM:
    nvmlNvLinkUtilizationCountPktTypes_enum = 16;
pub const nvmlNvLinkUtilizationCountPktTypes_enum_NVML_NVLINK_COUNTER_PKTFILTER_FLUSH:
    nvmlNvLinkUtilizationCountPktTypes_enum = 32;
pub const nvmlNvLinkUtilizationCountPktTypes_enum_NVML_NVLINK_COUNTER_PKTFILTER_RESPDATA:
    nvmlNvLinkUtilizationCountPktTypes_enum = 64;
pub const nvmlNvLinkUtilizationCountPktTypes_enum_NVML_NVLINK_COUNTER_PKTFILTER_RESPNODATA:
    nvmlNvLinkUtilizationCountPktTypes_enum = 128;
pub const nvmlNvLinkUtilizationCountPktTypes_enum_NVML_NVLINK_COUNTER_PKTFILTER_ALL:
    nvmlNvLinkUtilizationCountPktTypes_enum = 255;
pub type nvmlNvLinkUtilizationCountPktTypes_enum = raw::c_uint;
pub use self::nvmlNvLinkUtilizationCountPktTypes_enum as nvmlNvLinkUtilizationCountPktTypes_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nvmlNvLinkUtilizationControl_st {
    pub units: nvmlNvLinkUtilizationCountUnits_t,
    pub pktfilter: nvmlNvLinkUtilizationCountPktTypes_t,
}
#[test]
fn bindgen_test_layout_nvmlNvLinkUtilizationControl_st() {
    assert_eq!(
        ::std::mem::size_of::<nvmlNvLinkUtilizationControl_st>(),
        8usize,
        concat!("Size of: ", stringify!(nvmlNvLinkUtilizationControl_st))
    );
    assert_eq!(
        ::std::mem::align_of::<nvmlNvLinkUtilizationControl_st>(),
        4usize,
        concat!("Alignment of ", stringify!(nvmlNvLinkUtilizationControl_st))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlNvLinkUtilizationControl_st>())).units as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlNvLinkUtilizationControl_st),
            "::",
            stringify!(units)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlNvLinkUtilizationControl_st>())).pktfilter as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlNvLinkUtilizationControl_st),
            "::",
            stringify!(pktfilter)
        )
    );
}
pub type nvmlNvLinkUtilizationControl_t = nvmlNvLinkUtilizationControl_st;
pub const nvmlNvLinkCapability_enum_NVML_NVLINK_CAP_P2P_SUPPORTED: nvmlNvLinkCapability_enum = 0;
pub const nvmlNvLinkCapability_enum_NVML_NVLINK_CAP_SYSMEM_ACCESS: nvmlNvLinkCapability_enum = 1;
pub const nvmlNvLinkCapability_enum_NVML_NVLINK_CAP_P2P_ATOMICS: nvmlNvLinkCapability_enum = 2;
pub const nvmlNvLinkCapability_enum_NVML_NVLINK_CAP_SYSMEM_ATOMICS: nvmlNvLinkCapability_enum = 3;
pub const nvmlNvLinkCapability_enum_NVML_NVLINK_CAP_SLI_BRIDGE: nvmlNvLinkCapability_enum = 4;
pub const nvmlNvLinkCapability_enum_NVML_NVLINK_CAP_VALID: nvmlNvLinkCapability_enum = 5;
pub const nvmlNvLinkCapability_enum_NVML_NVLINK_CAP_COUNT: nvmlNvLinkCapability_enum = 6;
pub type nvmlNvLinkCapability_enum = raw::c_uint;
pub use self::nvmlNvLinkCapability_enum as nvmlNvLinkCapability_t;
pub const nvmlNvLinkErrorCounter_enum_NVML_NVLINK_ERROR_DL_REPLAY: nvmlNvLinkErrorCounter_enum = 0;
pub const nvmlNvLinkErrorCounter_enum_NVML_NVLINK_ERROR_DL_RECOVERY: nvmlNvLinkErrorCounter_enum =
    1;
pub const nvmlNvLinkErrorCounter_enum_NVML_NVLINK_ERROR_DL_CRC_FLIT: nvmlNvLinkErrorCounter_enum =
    2;
pub const nvmlNvLinkErrorCounter_enum_NVML_NVLINK_ERROR_DL_CRC_DATA: nvmlNvLinkErrorCounter_enum =
    3;
pub const nvmlNvLinkErrorCounter_enum_NVML_NVLINK_ERROR_COUNT: nvmlNvLinkErrorCounter_enum = 4;
pub type nvmlNvLinkErrorCounter_enum = raw::c_uint;
pub use self::nvmlNvLinkErrorCounter_enum as nvmlNvLinkErrorCounter_t;
pub const nvmlGpuLevel_enum_NVML_TOPOLOGY_INTERNAL: nvmlGpuLevel_enum = 0;
pub const nvmlGpuLevel_enum_NVML_TOPOLOGY_SINGLE: nvmlGpuLevel_enum = 10;
pub const nvmlGpuLevel_enum_NVML_TOPOLOGY_MULTIPLE: nvmlGpuLevel_enum = 20;
pub const nvmlGpuLevel_enum_NVML_TOPOLOGY_HOSTBRIDGE: nvmlGpuLevel_enum = 30;
pub const nvmlGpuLevel_enum_NVML_TOPOLOGY_NODE: nvmlGpuLevel_enum = 40;
pub const nvmlGpuLevel_enum_NVML_TOPOLOGY_SYSTEM: nvmlGpuLevel_enum = 50;
pub type nvmlGpuLevel_enum = raw::c_uint;
pub use self::nvmlGpuLevel_enum as nvmlGpuTopologyLevel_t;
pub const nvmlGpuP2PStatus_enum_NVML_P2P_STATUS_OK: nvmlGpuP2PStatus_enum = 0;
pub const nvmlGpuP2PStatus_enum_NVML_P2P_STATUS_CHIPSET_NOT_SUPPORED: nvmlGpuP2PStatus_enum = 1;
pub const nvmlGpuP2PStatus_enum_NVML_P2P_STATUS_GPU_NOT_SUPPORTED: nvmlGpuP2PStatus_enum = 2;
pub const nvmlGpuP2PStatus_enum_NVML_P2P_STATUS_IOH_TOPOLOGY_NOT_SUPPORTED: nvmlGpuP2PStatus_enum =
    3;
pub const nvmlGpuP2PStatus_enum_NVML_P2P_STATUS_DISABLED_BY_REGKEY: nvmlGpuP2PStatus_enum = 4;
pub const nvmlGpuP2PStatus_enum_NVML_P2P_STATUS_NOT_SUPPORTED: nvmlGpuP2PStatus_enum = 5;
pub const nvmlGpuP2PStatus_enum_NVML_P2P_STATUS_UNKNOWN: nvmlGpuP2PStatus_enum = 6;
pub type nvmlGpuP2PStatus_enum = raw::c_uint;
pub use self::nvmlGpuP2PStatus_enum as nvmlGpuP2PStatus_t;
pub const nvmlGpuP2PCapsIndex_enum_NVML_P2P_CAPS_INDEX_READ: nvmlGpuP2PCapsIndex_enum = 0;
pub const nvmlGpuP2PCapsIndex_enum_NVML_P2P_CAPS_INDEX_WRITE: nvmlGpuP2PCapsIndex_enum = 1;
pub const nvmlGpuP2PCapsIndex_enum_NVML_P2P_CAPS_INDEX_NVLINK: nvmlGpuP2PCapsIndex_enum = 2;
pub const nvmlGpuP2PCapsIndex_enum_NVML_P2P_CAPS_INDEX_ATOMICS: nvmlGpuP2PCapsIndex_enum = 3;
pub const nvmlGpuP2PCapsIndex_enum_NVML_P2P_CAPS_INDEX_PROP: nvmlGpuP2PCapsIndex_enum = 4;
pub const nvmlGpuP2PCapsIndex_enum_NVML_P2P_CAPS_INDEX_UNKNOWN: nvmlGpuP2PCapsIndex_enum = 5;
pub type nvmlGpuP2PCapsIndex_enum = raw::c_uint;
pub use self::nvmlGpuP2PCapsIndex_enum as nvmlGpuP2PCapsIndex_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nvmlBridgeChipInfo_st {
    pub type_: nvmlBridgeChipType_t,
    pub fwVersion: raw::c_uint,
}
#[test]
fn bindgen_test_layout_nvmlBridgeChipInfo_st() {
    assert_eq!(
        ::std::mem::size_of::<nvmlBridgeChipInfo_st>(),
        8usize,
        concat!("Size of: ", stringify!(nvmlBridgeChipInfo_st))
    );
    assert_eq!(
        ::std::mem::align_of::<nvmlBridgeChipInfo_st>(),
        4usize,
        concat!("Alignment of ", stringify!(nvmlBridgeChipInfo_st))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlBridgeChipInfo_st>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlBridgeChipInfo_st),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlBridgeChipInfo_st>())).fwVersion as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlBridgeChipInfo_st),
            "::",
            stringify!(fwVersion)
        )
    );
}
pub type nvmlBridgeChipInfo_t = nvmlBridgeChipInfo_st;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct nvmlBridgeChipHierarchy_st {
    pub bridgeCount: raw::c_uchar,
    pub bridgeChipInfo: [nvmlBridgeChipInfo_t; 128usize],
}
#[test]
fn bindgen_test_layout_nvmlBridgeChipHierarchy_st() {
    assert_eq!(
        ::std::mem::size_of::<nvmlBridgeChipHierarchy_st>(),
        1028usize,
        concat!("Size of: ", stringify!(nvmlBridgeChipHierarchy_st))
    );
    assert_eq!(
        ::std::mem::align_of::<nvmlBridgeChipHierarchy_st>(),
        4usize,
        concat!("Alignment of ", stringify!(nvmlBridgeChipHierarchy_st))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlBridgeChipHierarchy_st>())).bridgeCount as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlBridgeChipHierarchy_st),
            "::",
            stringify!(bridgeCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlBridgeChipHierarchy_st>())).bridgeChipInfo as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlBridgeChipHierarchy_st),
            "::",
            stringify!(bridgeChipInfo)
        )
    );
}
pub type nvmlBridgeChipHierarchy_t = nvmlBridgeChipHierarchy_st;
pub const nvmlSamplingType_enum_NVML_TOTAL_POWER_SAMPLES: nvmlSamplingType_enum = 0;
pub const nvmlSamplingType_enum_NVML_GPU_UTILIZATION_SAMPLES: nvmlSamplingType_enum = 1;
pub const nvmlSamplingType_enum_NVML_MEMORY_UTILIZATION_SAMPLES: nvmlSamplingType_enum = 2;
pub const nvmlSamplingType_enum_NVML_ENC_UTILIZATION_SAMPLES: nvmlSamplingType_enum = 3;
pub const nvmlSamplingType_enum_NVML_DEC_UTILIZATION_SAMPLES: nvmlSamplingType_enum = 4;
pub const nvmlSamplingType_enum_NVML_PROCESSOR_CLK_SAMPLES: nvmlSamplingType_enum = 5;
pub const nvmlSamplingType_enum_NVML_MEMORY_CLK_SAMPLES: nvmlSamplingType_enum = 6;
pub const nvmlSamplingType_enum_NVML_SAMPLINGTYPE_COUNT: nvmlSamplingType_enum = 7;
pub type nvmlSamplingType_enum = raw::c_uint;
pub use self::nvmlSamplingType_enum as nvmlSamplingType_t;
pub const nvmlPcieUtilCounter_enum_NVML_PCIE_UTIL_TX_BYTES: nvmlPcieUtilCounter_enum = 0;
pub const nvmlPcieUtilCounter_enum_NVML_PCIE_UTIL_RX_BYTES: nvmlPcieUtilCounter_enum = 1;
pub const nvmlPcieUtilCounter_enum_NVML_PCIE_UTIL_COUNT: nvmlPcieUtilCounter_enum = 2;
pub type nvmlPcieUtilCounter_enum = raw::c_uint;
pub use self::nvmlPcieUtilCounter_enum as nvmlPcieUtilCounter_t;
pub const nvmlValueType_enum_NVML_VALUE_TYPE_DOUBLE: nvmlValueType_enum = 0;
pub const nvmlValueType_enum_NVML_VALUE_TYPE_UNSIGNED_INT: nvmlValueType_enum = 1;
pub const nvmlValueType_enum_NVML_VALUE_TYPE_UNSIGNED_LONG: nvmlValueType_enum = 2;
pub const nvmlValueType_enum_NVML_VALUE_TYPE_UNSIGNED_LONG_LONG: nvmlValueType_enum = 3;
pub const nvmlValueType_enum_NVML_VALUE_TYPE_SIGNED_LONG_LONG: nvmlValueType_enum = 4;
pub const nvmlValueType_enum_NVML_VALUE_TYPE_COUNT: nvmlValueType_enum = 5;
pub type nvmlValueType_enum = raw::c_uint;
pub use self::nvmlValueType_enum as nvmlValueType_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub union nvmlValue_st {
    pub dVal: f64,
    pub uiVal: raw::c_uint,
    pub ulVal: raw::c_ulong,
    pub ullVal: raw::c_ulonglong,
    pub sllVal: raw::c_longlong,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_nvmlValue_st() {
    assert_eq!(
        ::std::mem::size_of::<nvmlValue_st>(),
        8usize,
        concat!("Size of: ", stringify!(nvmlValue_st))
    );
    assert_eq!(
        ::std::mem::align_of::<nvmlValue_st>(),
        8usize,
        concat!("Alignment of ", stringify!(nvmlValue_st))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlValue_st>())).dVal as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlValue_st),
            "::",
            stringify!(dVal)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlValue_st>())).uiVal as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlValue_st),
            "::",
            stringify!(uiVal)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlValue_st>())).ulVal as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlValue_st),
            "::",
            stringify!(ulVal)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlValue_st>())).ullVal as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlValue_st),
            "::",
            stringify!(ullVal)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlValue_st>())).sllVal as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlValue_st),
            "::",
            stringify!(sllVal)
        )
    );
}
pub type nvmlValue_t = nvmlValue_st;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct nvmlSample_st {
    pub timeStamp: raw::c_ulonglong,
    pub sampleValue: nvmlValue_t,
}
#[test]
fn bindgen_test_layout_nvmlSample_st() {
    assert_eq!(
        ::std::mem::size_of::<nvmlSample_st>(),
        16usize,
        concat!("Size of: ", stringify!(nvmlSample_st))
    );
    assert_eq!(
        ::std::mem::align_of::<nvmlSample_st>(),
        8usize,
        concat!("Alignment of ", stringify!(nvmlSample_st))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlSample_st>())).timeStamp as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlSample_st),
            "::",
            stringify!(timeStamp)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlSample_st>())).sampleValue as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlSample_st),
            "::",
            stringify!(sampleValue)
        )
    );
}
pub type nvmlSample_t = nvmlSample_st;
pub const nvmlPerfPolicyType_enum_NVML_PERF_POLICY_POWER: nvmlPerfPolicyType_enum = 0;
pub const nvmlPerfPolicyType_enum_NVML_PERF_POLICY_THERMAL: nvmlPerfPolicyType_enum = 1;
pub const nvmlPerfPolicyType_enum_NVML_PERF_POLICY_SYNC_BOOST: nvmlPerfPolicyType_enum = 2;
pub const nvmlPerfPolicyType_enum_NVML_PERF_POLICY_BOARD_LIMIT: nvmlPerfPolicyType_enum = 3;
pub const nvmlPerfPolicyType_enum_NVML_PERF_POLICY_LOW_UTILIZATION: nvmlPerfPolicyType_enum = 4;
pub const nvmlPerfPolicyType_enum_NVML_PERF_POLICY_RELIABILITY: nvmlPerfPolicyType_enum = 5;
pub const nvmlPerfPolicyType_enum_NVML_PERF_POLICY_TOTAL_APP_CLOCKS: nvmlPerfPolicyType_enum = 10;
pub const nvmlPerfPolicyType_enum_NVML_PERF_POLICY_TOTAL_BASE_CLOCKS: nvmlPerfPolicyType_enum = 11;
pub const nvmlPerfPolicyType_enum_NVML_PERF_POLICY_COUNT: nvmlPerfPolicyType_enum = 12;
pub type nvmlPerfPolicyType_enum = raw::c_uint;
pub use self::nvmlPerfPolicyType_enum as nvmlPerfPolicyType_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nvmlViolationTime_st {
    pub referenceTime: raw::c_ulonglong,
    pub violationTime: raw::c_ulonglong,
}
#[test]
fn bindgen_test_layout_nvmlViolationTime_st() {
    assert_eq!(
        ::std::mem::size_of::<nvmlViolationTime_st>(),
        16usize,
        concat!("Size of: ", stringify!(nvmlViolationTime_st))
    );
    assert_eq!(
        ::std::mem::align_of::<nvmlViolationTime_st>(),
        8usize,
        concat!("Alignment of ", stringify!(nvmlViolationTime_st))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlViolationTime_st>())).referenceTime as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlViolationTime_st),
            "::",
            stringify!(referenceTime)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlViolationTime_st>())).violationTime as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlViolationTime_st),
            "::",
            stringify!(violationTime)
        )
    );
}
pub type nvmlViolationTime_t = nvmlViolationTime_st;
pub const nvmlEnableState_enum_NVML_FEATURE_DISABLED: nvmlEnableState_enum = 0;
pub const nvmlEnableState_enum_NVML_FEATURE_ENABLED: nvmlEnableState_enum = 1;
pub type nvmlEnableState_enum = raw::c_uint;
pub use self::nvmlEnableState_enum as nvmlEnableState_t;
pub const nvmlBrandType_enum_NVML_BRAND_UNKNOWN: nvmlBrandType_enum = 0;
pub const nvmlBrandType_enum_NVML_BRAND_QUADRO: nvmlBrandType_enum = 1;
pub const nvmlBrandType_enum_NVML_BRAND_TESLA: nvmlBrandType_enum = 2;
pub const nvmlBrandType_enum_NVML_BRAND_NVS: nvmlBrandType_enum = 3;
pub const nvmlBrandType_enum_NVML_BRAND_GRID: nvmlBrandType_enum = 4;
pub const nvmlBrandType_enum_NVML_BRAND_GEFORCE: nvmlBrandType_enum = 5;
pub const nvmlBrandType_enum_NVML_BRAND_TITAN: nvmlBrandType_enum = 6;
pub const nvmlBrandType_enum_NVML_BRAND_COUNT: nvmlBrandType_enum = 7;
pub type nvmlBrandType_enum = raw::c_uint;
pub use self::nvmlBrandType_enum as nvmlBrandType_t;
pub const nvmlTemperatureThresholds_enum_NVML_TEMPERATURE_THRESHOLD_SHUTDOWN:
    nvmlTemperatureThresholds_enum = 0;
pub const nvmlTemperatureThresholds_enum_NVML_TEMPERATURE_THRESHOLD_SLOWDOWN:
    nvmlTemperatureThresholds_enum = 1;
pub const nvmlTemperatureThresholds_enum_NVML_TEMPERATURE_THRESHOLD_MEM_MAX:
    nvmlTemperatureThresholds_enum = 2;
pub const nvmlTemperatureThresholds_enum_NVML_TEMPERATURE_THRESHOLD_GPU_MAX:
    nvmlTemperatureThresholds_enum = 3;
pub const nvmlTemperatureThresholds_enum_NVML_TEMPERATURE_THRESHOLD_COUNT:
    nvmlTemperatureThresholds_enum = 4;
pub type nvmlTemperatureThresholds_enum = raw::c_uint;
pub use self::nvmlTemperatureThresholds_enum as nvmlTemperatureThresholds_t;
pub const nvmlTemperatureSensors_enum_NVML_TEMPERATURE_GPU: nvmlTemperatureSensors_enum = 0;
pub const nvmlTemperatureSensors_enum_NVML_TEMPERATURE_COUNT: nvmlTemperatureSensors_enum = 1;
pub type nvmlTemperatureSensors_enum = raw::c_uint;
pub use self::nvmlTemperatureSensors_enum as nvmlTemperatureSensors_t;
pub const nvmlComputeMode_enum_NVML_COMPUTEMODE_DEFAULT: nvmlComputeMode_enum = 0;
pub const nvmlComputeMode_enum_NVML_COMPUTEMODE_EXCLUSIVE_THREAD: nvmlComputeMode_enum = 1;
pub const nvmlComputeMode_enum_NVML_COMPUTEMODE_PROHIBITED: nvmlComputeMode_enum = 2;
pub const nvmlComputeMode_enum_NVML_COMPUTEMODE_EXCLUSIVE_PROCESS: nvmlComputeMode_enum = 3;
pub const nvmlComputeMode_enum_NVML_COMPUTEMODE_COUNT: nvmlComputeMode_enum = 4;
pub type nvmlComputeMode_enum = raw::c_uint;
pub use self::nvmlComputeMode_enum as nvmlComputeMode_t;
pub const nvmlMemoryErrorType_enum_NVML_MEMORY_ERROR_TYPE_CORRECTED: nvmlMemoryErrorType_enum = 0;
pub const nvmlMemoryErrorType_enum_NVML_MEMORY_ERROR_TYPE_UNCORRECTED: nvmlMemoryErrorType_enum = 1;
pub const nvmlMemoryErrorType_enum_NVML_MEMORY_ERROR_TYPE_COUNT: nvmlMemoryErrorType_enum = 2;
pub type nvmlMemoryErrorType_enum = raw::c_uint;
pub use self::nvmlMemoryErrorType_enum as nvmlMemoryErrorType_t;
pub const nvmlEccCounterType_enum_NVML_VOLATILE_ECC: nvmlEccCounterType_enum = 0;
pub const nvmlEccCounterType_enum_NVML_AGGREGATE_ECC: nvmlEccCounterType_enum = 1;
pub const nvmlEccCounterType_enum_NVML_ECC_COUNTER_TYPE_COUNT: nvmlEccCounterType_enum = 2;
pub type nvmlEccCounterType_enum = raw::c_uint;
pub use self::nvmlEccCounterType_enum as nvmlEccCounterType_t;
pub const nvmlClockType_enum_NVML_CLOCK_GRAPHICS: nvmlClockType_enum = 0;
pub const nvmlClockType_enum_NVML_CLOCK_SM: nvmlClockType_enum = 1;
pub const nvmlClockType_enum_NVML_CLOCK_MEM: nvmlClockType_enum = 2;
pub const nvmlClockType_enum_NVML_CLOCK_VIDEO: nvmlClockType_enum = 3;
pub const nvmlClockType_enum_NVML_CLOCK_COUNT: nvmlClockType_enum = 4;
pub type nvmlClockType_enum = raw::c_uint;
pub use self::nvmlClockType_enum as nvmlClockType_t;
pub const nvmlClockId_enum_NVML_CLOCK_ID_CURRENT: nvmlClockId_enum = 0;
pub const nvmlClockId_enum_NVML_CLOCK_ID_APP_CLOCK_TARGET: nvmlClockId_enum = 1;
pub const nvmlClockId_enum_NVML_CLOCK_ID_APP_CLOCK_DEFAULT: nvmlClockId_enum = 2;
pub const nvmlClockId_enum_NVML_CLOCK_ID_CUSTOMER_BOOST_MAX: nvmlClockId_enum = 3;
pub const nvmlClockId_enum_NVML_CLOCK_ID_COUNT: nvmlClockId_enum = 4;
pub type nvmlClockId_enum = raw::c_uint;
pub use self::nvmlClockId_enum as nvmlClockId_t;
pub const nvmlDriverModel_enum_NVML_DRIVER_WDDM: nvmlDriverModel_enum = 0;
pub const nvmlDriverModel_enum_NVML_DRIVER_WDM: nvmlDriverModel_enum = 1;
pub type nvmlDriverModel_enum = raw::c_uint;
pub use self::nvmlDriverModel_enum as nvmlDriverModel_t;
pub const nvmlPStates_enum_NVML_PSTATE_0: nvmlPStates_enum = 0;
pub const nvmlPStates_enum_NVML_PSTATE_1: nvmlPStates_enum = 1;
pub const nvmlPStates_enum_NVML_PSTATE_2: nvmlPStates_enum = 2;
pub const nvmlPStates_enum_NVML_PSTATE_3: nvmlPStates_enum = 3;
pub const nvmlPStates_enum_NVML_PSTATE_4: nvmlPStates_enum = 4;
pub const nvmlPStates_enum_NVML_PSTATE_5: nvmlPStates_enum = 5;
pub const nvmlPStates_enum_NVML_PSTATE_6: nvmlPStates_enum = 6;
pub const nvmlPStates_enum_NVML_PSTATE_7: nvmlPStates_enum = 7;
pub const nvmlPStates_enum_NVML_PSTATE_8: nvmlPStates_enum = 8;
pub const nvmlPStates_enum_NVML_PSTATE_9: nvmlPStates_enum = 9;
pub const nvmlPStates_enum_NVML_PSTATE_10: nvmlPStates_enum = 10;
pub const nvmlPStates_enum_NVML_PSTATE_11: nvmlPStates_enum = 11;
pub const nvmlPStates_enum_NVML_PSTATE_12: nvmlPStates_enum = 12;
pub const nvmlPStates_enum_NVML_PSTATE_13: nvmlPStates_enum = 13;
pub const nvmlPStates_enum_NVML_PSTATE_14: nvmlPStates_enum = 14;
pub const nvmlPStates_enum_NVML_PSTATE_15: nvmlPStates_enum = 15;
pub const nvmlPStates_enum_NVML_PSTATE_UNKNOWN: nvmlPStates_enum = 32;
pub type nvmlPStates_enum = raw::c_uint;
pub use self::nvmlPStates_enum as nvmlPstates_t;
pub const nvmlGom_enum_NVML_GOM_ALL_ON: nvmlGom_enum = 0;
pub const nvmlGom_enum_NVML_GOM_COMPUTE: nvmlGom_enum = 1;
pub const nvmlGom_enum_NVML_GOM_LOW_DP: nvmlGom_enum = 2;
pub type nvmlGom_enum = raw::c_uint;
pub use self::nvmlGom_enum as nvmlGpuOperationMode_t;
pub const nvmlInforomObject_enum_NVML_INFOROM_OEM: nvmlInforomObject_enum = 0;
pub const nvmlInforomObject_enum_NVML_INFOROM_ECC: nvmlInforomObject_enum = 1;
pub const nvmlInforomObject_enum_NVML_INFOROM_POWER: nvmlInforomObject_enum = 2;
pub const nvmlInforomObject_enum_NVML_INFOROM_COUNT: nvmlInforomObject_enum = 3;
pub type nvmlInforomObject_enum = raw::c_uint;
pub use self::nvmlInforomObject_enum as nvmlInforomObject_t;
pub const nvmlReturn_enum_NVML_SUCCESS: nvmlReturn_enum = 0;
pub const nvmlReturn_enum_NVML_ERROR_UNINITIALIZED: nvmlReturn_enum = 1;
pub const nvmlReturn_enum_NVML_ERROR_INVALID_ARGUMENT: nvmlReturn_enum = 2;
pub const nvmlReturn_enum_NVML_ERROR_NOT_SUPPORTED: nvmlReturn_enum = 3;
pub const nvmlReturn_enum_NVML_ERROR_NO_PERMISSION: nvmlReturn_enum = 4;
pub const nvmlReturn_enum_NVML_ERROR_ALREADY_INITIALIZED: nvmlReturn_enum = 5;
pub const nvmlReturn_enum_NVML_ERROR_NOT_FOUND: nvmlReturn_enum = 6;
pub const nvmlReturn_enum_NVML_ERROR_INSUFFICIENT_SIZE: nvmlReturn_enum = 7;
pub const nvmlReturn_enum_NVML_ERROR_INSUFFICIENT_POWER: nvmlReturn_enum = 8;
pub const nvmlReturn_enum_NVML_ERROR_DRIVER_NOT_LOADED: nvmlReturn_enum = 9;
pub const nvmlReturn_enum_NVML_ERROR_TIMEOUT: nvmlReturn_enum = 10;
pub const nvmlReturn_enum_NVML_ERROR_IRQ_ISSUE: nvmlReturn_enum = 11;
pub const nvmlReturn_enum_NVML_ERROR_LIBRARY_NOT_FOUND: nvmlReturn_enum = 12;
pub const nvmlReturn_enum_NVML_ERROR_FUNCTION_NOT_FOUND: nvmlReturn_enum = 13;
pub const nvmlReturn_enum_NVML_ERROR_CORRUPTED_INFOROM: nvmlReturn_enum = 14;
pub const nvmlReturn_enum_NVML_ERROR_GPU_IS_LOST: nvmlReturn_enum = 15;
pub const nvmlReturn_enum_NVML_ERROR_RESET_REQUIRED: nvmlReturn_enum = 16;
pub const nvmlReturn_enum_NVML_ERROR_OPERATING_SYSTEM: nvmlReturn_enum = 17;
pub const nvmlReturn_enum_NVML_ERROR_LIB_RM_VERSION_MISMATCH: nvmlReturn_enum = 18;
pub const nvmlReturn_enum_NVML_ERROR_IN_USE: nvmlReturn_enum = 19;
pub const nvmlReturn_enum_NVML_ERROR_MEMORY: nvmlReturn_enum = 20;
pub const nvmlReturn_enum_NVML_ERROR_NO_DATA: nvmlReturn_enum = 21;
pub const nvmlReturn_enum_NVML_ERROR_VGPU_ECC_NOT_SUPPORTED: nvmlReturn_enum = 22;
pub const nvmlReturn_enum_NVML_ERROR_INSUFFICIENT_RESOURCES: nvmlReturn_enum = 23;
pub const nvmlReturn_enum_NVML_ERROR_UNKNOWN: nvmlReturn_enum = 999;
pub type nvmlReturn_enum = raw::c_uint;
pub use self::nvmlReturn_enum as nvmlReturn_t;
pub const nvmlMemoryLocation_enum_NVML_MEMORY_LOCATION_L1_CACHE: nvmlMemoryLocation_enum = 0;
pub const nvmlMemoryLocation_enum_NVML_MEMORY_LOCATION_L2_CACHE: nvmlMemoryLocation_enum = 1;
pub const nvmlMemoryLocation_enum_NVML_MEMORY_LOCATION_DRAM: nvmlMemoryLocation_enum = 2;
pub const nvmlMemoryLocation_enum_NVML_MEMORY_LOCATION_DEVICE_MEMORY: nvmlMemoryLocation_enum = 2;
pub const nvmlMemoryLocation_enum_NVML_MEMORY_LOCATION_REGISTER_FILE: nvmlMemoryLocation_enum = 3;
pub const nvmlMemoryLocation_enum_NVML_MEMORY_LOCATION_TEXTURE_MEMORY: nvmlMemoryLocation_enum = 4;
pub const nvmlMemoryLocation_enum_NVML_MEMORY_LOCATION_TEXTURE_SHM: nvmlMemoryLocation_enum = 5;
pub const nvmlMemoryLocation_enum_NVML_MEMORY_LOCATION_CBU: nvmlMemoryLocation_enum = 6;
pub const nvmlMemoryLocation_enum_NVML_MEMORY_LOCATION_SRAM: nvmlMemoryLocation_enum = 7;
pub const nvmlMemoryLocation_enum_NVML_MEMORY_LOCATION_COUNT: nvmlMemoryLocation_enum = 8;
pub type nvmlMemoryLocation_enum = raw::c_uint;
pub use self::nvmlMemoryLocation_enum as nvmlMemoryLocation_t;
pub const nvmlPageRetirementCause_enum_NVML_PAGE_RETIREMENT_CAUSE_MULTIPLE_SINGLE_BIT_ECC_ERRORS:
    nvmlPageRetirementCause_enum = 0;
pub const nvmlPageRetirementCause_enum_NVML_PAGE_RETIREMENT_CAUSE_DOUBLE_BIT_ECC_ERROR:
    nvmlPageRetirementCause_enum = 1;
pub const nvmlPageRetirementCause_enum_NVML_PAGE_RETIREMENT_CAUSE_COUNT:
    nvmlPageRetirementCause_enum = 2;
pub type nvmlPageRetirementCause_enum = raw::c_uint;
pub use self::nvmlPageRetirementCause_enum as nvmlPageRetirementCause_t;
pub const nvmlRestrictedAPI_enum_NVML_RESTRICTED_API_SET_APPLICATION_CLOCKS:
    nvmlRestrictedAPI_enum = 0;
pub const nvmlRestrictedAPI_enum_NVML_RESTRICTED_API_SET_AUTO_BOOSTED_CLOCKS:
    nvmlRestrictedAPI_enum = 1;
pub const nvmlRestrictedAPI_enum_NVML_RESTRICTED_API_COUNT: nvmlRestrictedAPI_enum = 2;
pub type nvmlRestrictedAPI_enum = raw::c_uint;
pub use self::nvmlRestrictedAPI_enum as nvmlRestrictedAPI_t;
pub const nvmlGpuVirtualizationMode_NVML_GPU_VIRTUALIZATION_MODE_NONE: nvmlGpuVirtualizationMode =
    0;
pub const nvmlGpuVirtualizationMode_NVML_GPU_VIRTUALIZATION_MODE_PASSTHROUGH:
    nvmlGpuVirtualizationMode = 1;
pub const nvmlGpuVirtualizationMode_NVML_GPU_VIRTUALIZATION_MODE_VGPU: nvmlGpuVirtualizationMode =
    2;
pub const nvmlGpuVirtualizationMode_NVML_GPU_VIRTUALIZATION_MODE_HOST_VGPU:
    nvmlGpuVirtualizationMode = 3;
pub const nvmlGpuVirtualizationMode_NVML_GPU_VIRTUALIZATION_MODE_HOST_VSGA:
    nvmlGpuVirtualizationMode = 4;
pub type nvmlGpuVirtualizationMode = raw::c_uint;
pub use self::nvmlGpuVirtualizationMode as nvmlGpuVirtualizationMode_t;
pub const nvmlHostVgpuMode_enum_NVML_HOST_VGPU_MODE_NON_SRIOV: nvmlHostVgpuMode_enum = 0;
pub const nvmlHostVgpuMode_enum_NVML_HOST_VGPU_MODE_SRIOV: nvmlHostVgpuMode_enum = 1;
pub type nvmlHostVgpuMode_enum = raw::c_uint;
pub use self::nvmlHostVgpuMode_enum as nvmlHostVgpuMode_t;
pub const nvmlVgpuVmIdType_NVML_VGPU_VM_ID_DOMAIN_ID: nvmlVgpuVmIdType = 0;
pub const nvmlVgpuVmIdType_NVML_VGPU_VM_ID_UUID: nvmlVgpuVmIdType = 1;
pub type nvmlVgpuVmIdType = raw::c_uint;
pub use self::nvmlVgpuVmIdType as nvmlVgpuVmIdType_t;
pub const nvmlVgpuGuestInfoState_enum_NVML_VGPU_INSTANCE_GUEST_INFO_STATE_UNINITIALIZED:
    nvmlVgpuGuestInfoState_enum = 0;
pub const nvmlVgpuGuestInfoState_enum_NVML_VGPU_INSTANCE_GUEST_INFO_STATE_INITIALIZED:
    nvmlVgpuGuestInfoState_enum = 1;
pub type nvmlVgpuGuestInfoState_enum = raw::c_uint;
pub use self::nvmlVgpuGuestInfoState_enum as nvmlVgpuGuestInfoState_t;
pub const nvmlGridLicenseFeatureCode_t_NVML_GRID_LICENSE_FEATURE_CODE_VGPU:
    nvmlGridLicenseFeatureCode_t = 1;
pub const nvmlGridLicenseFeatureCode_t_NVML_GRID_LICENSE_FEATURE_CODE_VWORKSTATION:
    nvmlGridLicenseFeatureCode_t = 2;
pub type nvmlGridLicenseFeatureCode_t = raw::c_uint;
pub type nvmlVgpuTypeId_t = raw::c_uint;
pub type nvmlVgpuInstance_t = raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct nvmlVgpuInstanceUtilizationSample_st {
    pub vgpuInstance: nvmlVgpuInstance_t,
    pub timeStamp: raw::c_ulonglong,
    pub smUtil: nvmlValue_t,
    pub memUtil: nvmlValue_t,
    pub encUtil: nvmlValue_t,
    pub decUtil: nvmlValue_t,
}
#[test]
fn bindgen_test_layout_nvmlVgpuInstanceUtilizationSample_st() {
    assert_eq!(
        ::std::mem::size_of::<nvmlVgpuInstanceUtilizationSample_st>(),
        48usize,
        concat!(
            "Size of: ",
            stringify!(nvmlVgpuInstanceUtilizationSample_st)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<nvmlVgpuInstanceUtilizationSample_st>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(nvmlVgpuInstanceUtilizationSample_st)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlVgpuInstanceUtilizationSample_st>())).vgpuInstance
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlVgpuInstanceUtilizationSample_st),
            "::",
            stringify!(vgpuInstance)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlVgpuInstanceUtilizationSample_st>())).timeStamp as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlVgpuInstanceUtilizationSample_st),
            "::",
            stringify!(timeStamp)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlVgpuInstanceUtilizationSample_st>())).smUtil as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlVgpuInstanceUtilizationSample_st),
            "::",
            stringify!(smUtil)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlVgpuInstanceUtilizationSample_st>())).memUtil as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlVgpuInstanceUtilizationSample_st),
            "::",
            stringify!(memUtil)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlVgpuInstanceUtilizationSample_st>())).encUtil as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlVgpuInstanceUtilizationSample_st),
            "::",
            stringify!(encUtil)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlVgpuInstanceUtilizationSample_st>())).decUtil as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlVgpuInstanceUtilizationSample_st),
            "::",
            stringify!(decUtil)
        )
    );
}
pub type nvmlVgpuInstanceUtilizationSample_t = nvmlVgpuInstanceUtilizationSample_st;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct nvmlVgpuProcessUtilizationSample_st {
    pub vgpuInstance: nvmlVgpuInstance_t,
    pub pid: raw::c_uint,
    pub processName: [raw::c_char; 64usize],
    pub timeStamp: raw::c_ulonglong,
    pub smUtil: raw::c_uint,
    pub memUtil: raw::c_uint,
    pub encUtil: raw::c_uint,
    pub decUtil: raw::c_uint,
}
#[test]
fn bindgen_test_layout_nvmlVgpuProcessUtilizationSample_st() {
    assert_eq!(
        ::std::mem::size_of::<nvmlVgpuProcessUtilizationSample_st>(),
        96usize,
        concat!("Size of: ", stringify!(nvmlVgpuProcessUtilizationSample_st))
    );
    assert_eq!(
        ::std::mem::align_of::<nvmlVgpuProcessUtilizationSample_st>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(nvmlVgpuProcessUtilizationSample_st)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlVgpuProcessUtilizationSample_st>())).vgpuInstance as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlVgpuProcessUtilizationSample_st),
            "::",
            stringify!(vgpuInstance)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlVgpuProcessUtilizationSample_st>())).pid as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlVgpuProcessUtilizationSample_st),
            "::",
            stringify!(pid)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlVgpuProcessUtilizationSample_st>())).processName as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlVgpuProcessUtilizationSample_st),
            "::",
            stringify!(processName)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlVgpuProcessUtilizationSample_st>())).timeStamp as *const _
                as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlVgpuProcessUtilizationSample_st),
            "::",
            stringify!(timeStamp)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlVgpuProcessUtilizationSample_st>())).smUtil as *const _
                as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlVgpuProcessUtilizationSample_st),
            "::",
            stringify!(smUtil)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlVgpuProcessUtilizationSample_st>())).memUtil as *const _
                as usize
        },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlVgpuProcessUtilizationSample_st),
            "::",
            stringify!(memUtil)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlVgpuProcessUtilizationSample_st>())).encUtil as *const _
                as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlVgpuProcessUtilizationSample_st),
            "::",
            stringify!(encUtil)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlVgpuProcessUtilizationSample_st>())).decUtil as *const _
                as usize
        },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlVgpuProcessUtilizationSample_st),
            "::",
            stringify!(decUtil)
        )
    );
}
pub type nvmlVgpuProcessUtilizationSample_t = nvmlVgpuProcessUtilizationSample_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nvmlProcessUtilizationSample_st {
    pub pid: raw::c_uint,
    pub timeStamp: raw::c_ulonglong,
    pub smUtil: raw::c_uint,
    pub memUtil: raw::c_uint,
    pub encUtil: raw::c_uint,
    pub decUtil: raw::c_uint,
}
#[test]
fn bindgen_test_layout_nvmlProcessUtilizationSample_st() {
    assert_eq!(
        ::std::mem::size_of::<nvmlProcessUtilizationSample_st>(),
        32usize,
        concat!("Size of: ", stringify!(nvmlProcessUtilizationSample_st))
    );
    assert_eq!(
        ::std::mem::align_of::<nvmlProcessUtilizationSample_st>(),
        8usize,
        concat!("Alignment of ", stringify!(nvmlProcessUtilizationSample_st))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlProcessUtilizationSample_st>())).pid as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlProcessUtilizationSample_st),
            "::",
            stringify!(pid)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlProcessUtilizationSample_st>())).timeStamp as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlProcessUtilizationSample_st),
            "::",
            stringify!(timeStamp)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlProcessUtilizationSample_st>())).smUtil as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlProcessUtilizationSample_st),
            "::",
            stringify!(smUtil)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlProcessUtilizationSample_st>())).memUtil as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlProcessUtilizationSample_st),
            "::",
            stringify!(memUtil)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlProcessUtilizationSample_st>())).encUtil as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlProcessUtilizationSample_st),
            "::",
            stringify!(encUtil)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlProcessUtilizationSample_st>())).decUtil as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlProcessUtilizationSample_st),
            "::",
            stringify!(decUtil)
        )
    );
}
pub type nvmlProcessUtilizationSample_t = nvmlProcessUtilizationSample_st;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct nvmlGridLicensableFeature_st {
    pub featureCode: nvmlGridLicenseFeatureCode_t,
    pub featureState: raw::c_uint,
    pub licenseInfo: [raw::c_char; 128usize],
    pub productName: [raw::c_char; 128usize],
    pub featureEnabled: raw::c_uint,
}
#[test]
fn bindgen_test_layout_nvmlGridLicensableFeature_st() {
    assert_eq!(
        ::std::mem::size_of::<nvmlGridLicensableFeature_st>(),
        268usize,
        concat!("Size of: ", stringify!(nvmlGridLicensableFeature_st))
    );
    assert_eq!(
        ::std::mem::align_of::<nvmlGridLicensableFeature_st>(),
        4usize,
        concat!("Alignment of ", stringify!(nvmlGridLicensableFeature_st))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlGridLicensableFeature_st>())).featureCode as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlGridLicensableFeature_st),
            "::",
            stringify!(featureCode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlGridLicensableFeature_st>())).featureState as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlGridLicensableFeature_st),
            "::",
            stringify!(featureState)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlGridLicensableFeature_st>())).licenseInfo as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlGridLicensableFeature_st),
            "::",
            stringify!(licenseInfo)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlGridLicensableFeature_st>())).productName as *const _
                as usize
        },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlGridLicensableFeature_st),
            "::",
            stringify!(productName)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlGridLicensableFeature_st>())).featureEnabled as *const _
                as usize
        },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlGridLicensableFeature_st),
            "::",
            stringify!(featureEnabled)
        )
    );
}
pub type nvmlGridLicensableFeature_t = nvmlGridLicensableFeature_st;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct nvmlGridLicensableFeatures_st {
    pub isGridLicenseSupported: raw::c_int,
    pub licensableFeaturesCount: raw::c_uint,
    pub gridLicensableFeatures: [nvmlGridLicensableFeature_t; 3usize],
}
#[test]
fn bindgen_test_layout_nvmlGridLicensableFeatures_st() {
    assert_eq!(
        ::std::mem::size_of::<nvmlGridLicensableFeatures_st>(),
        812usize,
        concat!("Size of: ", stringify!(nvmlGridLicensableFeatures_st))
    );
    assert_eq!(
        ::std::mem::align_of::<nvmlGridLicensableFeatures_st>(),
        4usize,
        concat!("Alignment of ", stringify!(nvmlGridLicensableFeatures_st))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlGridLicensableFeatures_st>())).isGridLicenseSupported
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlGridLicensableFeatures_st),
            "::",
            stringify!(isGridLicenseSupported)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlGridLicensableFeatures_st>())).licensableFeaturesCount
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlGridLicensableFeatures_st),
            "::",
            stringify!(licensableFeaturesCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlGridLicensableFeatures_st>())).gridLicensableFeatures
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlGridLicensableFeatures_st),
            "::",
            stringify!(gridLicensableFeatures)
        )
    );
}
pub type nvmlGridLicensableFeatures_t = nvmlGridLicensableFeatures_st;
pub type nvmlDeviceArchitecture_t = raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct nvmlFieldValue_st {
    pub fieldId: raw::c_uint,
    pub scopeId: raw::c_uint,
    pub timestamp: raw::c_longlong,
    pub latencyUsec: raw::c_longlong,
    pub valueType: nvmlValueType_t,
    pub nvmlReturn: nvmlReturn_t,
    pub value: nvmlValue_t,
}
#[test]
fn bindgen_test_layout_nvmlFieldValue_st() {
    assert_eq!(
        ::std::mem::size_of::<nvmlFieldValue_st>(),
        40usize,
        concat!("Size of: ", stringify!(nvmlFieldValue_st))
    );
    assert_eq!(
        ::std::mem::align_of::<nvmlFieldValue_st>(),
        8usize,
        concat!("Alignment of ", stringify!(nvmlFieldValue_st))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlFieldValue_st>())).fieldId as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlFieldValue_st),
            "::",
            stringify!(fieldId)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlFieldValue_st>())).scopeId as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlFieldValue_st),
            "::",
            stringify!(scopeId)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlFieldValue_st>())).timestamp as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlFieldValue_st),
            "::",
            stringify!(timestamp)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlFieldValue_st>())).latencyUsec as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlFieldValue_st),
            "::",
            stringify!(latencyUsec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlFieldValue_st>())).valueType as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlFieldValue_st),
            "::",
            stringify!(valueType)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlFieldValue_st>())).nvmlReturn as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlFieldValue_st),
            "::",
            stringify!(nvmlReturn)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlFieldValue_st>())).value as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlFieldValue_st),
            "::",
            stringify!(value)
        )
    );
}
pub type nvmlFieldValue_t = nvmlFieldValue_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nvmlUnit_st {
    _unused: [u8; 0],
}
pub type nvmlUnit_t = *mut nvmlUnit_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nvmlHwbcEntry_st {
    pub hwbcId: raw::c_uint,
    pub firmwareVersion: [raw::c_char; 32usize],
}
#[test]
fn bindgen_test_layout_nvmlHwbcEntry_st() {
    assert_eq!(
        ::std::mem::size_of::<nvmlHwbcEntry_st>(),
        36usize,
        concat!("Size of: ", stringify!(nvmlHwbcEntry_st))
    );
    assert_eq!(
        ::std::mem::align_of::<nvmlHwbcEntry_st>(),
        4usize,
        concat!("Alignment of ", stringify!(nvmlHwbcEntry_st))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlHwbcEntry_st>())).hwbcId as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlHwbcEntry_st),
            "::",
            stringify!(hwbcId)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlHwbcEntry_st>())).firmwareVersion as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlHwbcEntry_st),
            "::",
            stringify!(firmwareVersion)
        )
    );
}
pub type nvmlHwbcEntry_t = nvmlHwbcEntry_st;
pub const nvmlFanState_enum_NVML_FAN_NORMAL: nvmlFanState_enum = 0;
pub const nvmlFanState_enum_NVML_FAN_FAILED: nvmlFanState_enum = 1;
pub type nvmlFanState_enum = raw::c_uint;
pub use self::nvmlFanState_enum as nvmlFanState_t;
pub const nvmlLedColor_enum_NVML_LED_COLOR_GREEN: nvmlLedColor_enum = 0;
pub const nvmlLedColor_enum_NVML_LED_COLOR_AMBER: nvmlLedColor_enum = 1;
pub type nvmlLedColor_enum = raw::c_uint;
pub use self::nvmlLedColor_enum as nvmlLedColor_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct nvmlLedState_st {
    pub cause: [raw::c_char; 256usize],
    pub color: nvmlLedColor_t,
}
#[test]
fn bindgen_test_layout_nvmlLedState_st() {
    assert_eq!(
        ::std::mem::size_of::<nvmlLedState_st>(),
        260usize,
        concat!("Size of: ", stringify!(nvmlLedState_st))
    );
    assert_eq!(
        ::std::mem::align_of::<nvmlLedState_st>(),
        4usize,
        concat!("Alignment of ", stringify!(nvmlLedState_st))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlLedState_st>())).cause as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlLedState_st),
            "::",
            stringify!(cause)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlLedState_st>())).color as *const _ as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlLedState_st),
            "::",
            stringify!(color)
        )
    );
}
pub type nvmlLedState_t = nvmlLedState_st;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct nvmlUnitInfo_st {
    pub name: [raw::c_char; 96usize],
    pub id: [raw::c_char; 96usize],
    pub serial: [raw::c_char; 96usize],
    pub firmwareVersion: [raw::c_char; 96usize],
}
#[test]
fn bindgen_test_layout_nvmlUnitInfo_st() {
    assert_eq!(
        ::std::mem::size_of::<nvmlUnitInfo_st>(),
        384usize,
        concat!("Size of: ", stringify!(nvmlUnitInfo_st))
    );
    assert_eq!(
        ::std::mem::align_of::<nvmlUnitInfo_st>(),
        1usize,
        concat!("Alignment of ", stringify!(nvmlUnitInfo_st))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlUnitInfo_st>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlUnitInfo_st),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlUnitInfo_st>())).id as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlUnitInfo_st),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlUnitInfo_st>())).serial as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlUnitInfo_st),
            "::",
            stringify!(serial)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlUnitInfo_st>())).firmwareVersion as *const _ as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlUnitInfo_st),
            "::",
            stringify!(firmwareVersion)
        )
    );
}
pub type nvmlUnitInfo_t = nvmlUnitInfo_st;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct nvmlPSUInfo_st {
    pub state: [raw::c_char; 256usize],
    pub current: raw::c_uint,
    pub voltage: raw::c_uint,
    pub power: raw::c_uint,
}
#[test]
fn bindgen_test_layout_nvmlPSUInfo_st() {
    assert_eq!(
        ::std::mem::size_of::<nvmlPSUInfo_st>(),
        268usize,
        concat!("Size of: ", stringify!(nvmlPSUInfo_st))
    );
    assert_eq!(
        ::std::mem::align_of::<nvmlPSUInfo_st>(),
        4usize,
        concat!("Alignment of ", stringify!(nvmlPSUInfo_st))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlPSUInfo_st>())).state as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlPSUInfo_st),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlPSUInfo_st>())).current as *const _ as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlPSUInfo_st),
            "::",
            stringify!(current)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlPSUInfo_st>())).voltage as *const _ as usize },
        260usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlPSUInfo_st),
            "::",
            stringify!(voltage)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlPSUInfo_st>())).power as *const _ as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlPSUInfo_st),
            "::",
            stringify!(power)
        )
    );
}
pub type nvmlPSUInfo_t = nvmlPSUInfo_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nvmlUnitFanInfo_st {
    pub speed: raw::c_uint,
    pub state: nvmlFanState_t,
}
#[test]
fn bindgen_test_layout_nvmlUnitFanInfo_st() {
    assert_eq!(
        ::std::mem::size_of::<nvmlUnitFanInfo_st>(),
        8usize,
        concat!("Size of: ", stringify!(nvmlUnitFanInfo_st))
    );
    assert_eq!(
        ::std::mem::align_of::<nvmlUnitFanInfo_st>(),
        4usize,
        concat!("Alignment of ", stringify!(nvmlUnitFanInfo_st))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlUnitFanInfo_st>())).speed as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlUnitFanInfo_st),
            "::",
            stringify!(speed)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlUnitFanInfo_st>())).state as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlUnitFanInfo_st),
            "::",
            stringify!(state)
        )
    );
}
pub type nvmlUnitFanInfo_t = nvmlUnitFanInfo_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nvmlUnitFanSpeeds_st {
    pub fans: [nvmlUnitFanInfo_t; 24usize],
    pub count: raw::c_uint,
}
#[test]
fn bindgen_test_layout_nvmlUnitFanSpeeds_st() {
    assert_eq!(
        ::std::mem::size_of::<nvmlUnitFanSpeeds_st>(),
        196usize,
        concat!("Size of: ", stringify!(nvmlUnitFanSpeeds_st))
    );
    assert_eq!(
        ::std::mem::align_of::<nvmlUnitFanSpeeds_st>(),
        4usize,
        concat!("Alignment of ", stringify!(nvmlUnitFanSpeeds_st))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlUnitFanSpeeds_st>())).fans as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlUnitFanSpeeds_st),
            "::",
            stringify!(fans)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlUnitFanSpeeds_st>())).count as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlUnitFanSpeeds_st),
            "::",
            stringify!(count)
        )
    );
}
pub type nvmlUnitFanSpeeds_t = nvmlUnitFanSpeeds_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nvmlEventSet_st {
    _unused: [u8; 0],
}
pub type nvmlEventSet_t = *mut nvmlEventSet_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nvmlEventData_st {
    pub device: nvmlDevice_t,
    pub eventType: raw::c_ulonglong,
    pub eventData: raw::c_ulonglong,
    pub gpuInstanceId: raw::c_uint,
    pub computeInstanceId: raw::c_uint,
}
#[test]
fn bindgen_test_layout_nvmlEventData_st() {
    assert_eq!(
        ::std::mem::size_of::<nvmlEventData_st>(),
        32usize,
        concat!("Size of: ", stringify!(nvmlEventData_st))
    );
    assert_eq!(
        ::std::mem::align_of::<nvmlEventData_st>(),
        8usize,
        concat!("Alignment of ", stringify!(nvmlEventData_st))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlEventData_st>())).device as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlEventData_st),
            "::",
            stringify!(device)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlEventData_st>())).eventType as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlEventData_st),
            "::",
            stringify!(eventType)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlEventData_st>())).eventData as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlEventData_st),
            "::",
            stringify!(eventData)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlEventData_st>())).gpuInstanceId as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlEventData_st),
            "::",
            stringify!(gpuInstanceId)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlEventData_st>())).computeInstanceId as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlEventData_st),
            "::",
            stringify!(computeInstanceId)
        )
    );
}
pub type nvmlEventData_t = nvmlEventData_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nvmlAccountingStats_st {
    pub gpuUtilization: raw::c_uint,
    pub memoryUtilization: raw::c_uint,
    pub maxMemoryUsage: raw::c_ulonglong,
    pub time: raw::c_ulonglong,
    pub startTime: raw::c_ulonglong,
    pub isRunning: raw::c_uint,
    pub reserved: [raw::c_uint; 5usize],
}
#[test]
fn bindgen_test_layout_nvmlAccountingStats_st() {
    assert_eq!(
        ::std::mem::size_of::<nvmlAccountingStats_st>(),
        56usize,
        concat!("Size of: ", stringify!(nvmlAccountingStats_st))
    );
    assert_eq!(
        ::std::mem::align_of::<nvmlAccountingStats_st>(),
        8usize,
        concat!("Alignment of ", stringify!(nvmlAccountingStats_st))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlAccountingStats_st>())).gpuUtilization as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlAccountingStats_st),
            "::",
            stringify!(gpuUtilization)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlAccountingStats_st>())).memoryUtilization as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlAccountingStats_st),
            "::",
            stringify!(memoryUtilization)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlAccountingStats_st>())).maxMemoryUsage as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlAccountingStats_st),
            "::",
            stringify!(maxMemoryUsage)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlAccountingStats_st>())).time as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlAccountingStats_st),
            "::",
            stringify!(time)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlAccountingStats_st>())).startTime as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlAccountingStats_st),
            "::",
            stringify!(startTime)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlAccountingStats_st>())).isRunning as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlAccountingStats_st),
            "::",
            stringify!(isRunning)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlAccountingStats_st>())).reserved as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlAccountingStats_st),
            "::",
            stringify!(reserved)
        )
    );
}
pub type nvmlAccountingStats_t = nvmlAccountingStats_st;
pub const nvmlEncoderQueryType_enum_NVML_ENCODER_QUERY_H264: nvmlEncoderQueryType_enum = 0;
pub const nvmlEncoderQueryType_enum_NVML_ENCODER_QUERY_HEVC: nvmlEncoderQueryType_enum = 1;
pub type nvmlEncoderQueryType_enum = raw::c_uint;
pub use self::nvmlEncoderQueryType_enum as nvmlEncoderType_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nvmlEncoderSessionInfo_st {
    pub sessionId: raw::c_uint,
    pub pid: raw::c_uint,
    pub vgpuInstance: nvmlVgpuInstance_t,
    pub codecType: nvmlEncoderType_t,
    pub hResolution: raw::c_uint,
    pub vResolution: raw::c_uint,
    pub averageFps: raw::c_uint,
    pub averageLatency: raw::c_uint,
}
#[test]
fn bindgen_test_layout_nvmlEncoderSessionInfo_st() {
    assert_eq!(
        ::std::mem::size_of::<nvmlEncoderSessionInfo_st>(),
        32usize,
        concat!("Size of: ", stringify!(nvmlEncoderSessionInfo_st))
    );
    assert_eq!(
        ::std::mem::align_of::<nvmlEncoderSessionInfo_st>(),
        4usize,
        concat!("Alignment of ", stringify!(nvmlEncoderSessionInfo_st))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlEncoderSessionInfo_st>())).sessionId as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlEncoderSessionInfo_st),
            "::",
            stringify!(sessionId)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlEncoderSessionInfo_st>())).pid as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlEncoderSessionInfo_st),
            "::",
            stringify!(pid)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlEncoderSessionInfo_st>())).vgpuInstance as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlEncoderSessionInfo_st),
            "::",
            stringify!(vgpuInstance)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlEncoderSessionInfo_st>())).codecType as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlEncoderSessionInfo_st),
            "::",
            stringify!(codecType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlEncoderSessionInfo_st>())).hResolution as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlEncoderSessionInfo_st),
            "::",
            stringify!(hResolution)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlEncoderSessionInfo_st>())).vResolution as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlEncoderSessionInfo_st),
            "::",
            stringify!(vResolution)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlEncoderSessionInfo_st>())).averageFps as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlEncoderSessionInfo_st),
            "::",
            stringify!(averageFps)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlEncoderSessionInfo_st>())).averageLatency as *const _
                as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlEncoderSessionInfo_st),
            "::",
            stringify!(averageLatency)
        )
    );
}
pub type nvmlEncoderSessionInfo_t = nvmlEncoderSessionInfo_st;
pub const nvmlFBCSessionType_enum_NVML_FBC_SESSION_TYPE_UNKNOWN: nvmlFBCSessionType_enum = 0;
pub const nvmlFBCSessionType_enum_NVML_FBC_SESSION_TYPE_TOSYS: nvmlFBCSessionType_enum = 1;
pub const nvmlFBCSessionType_enum_NVML_FBC_SESSION_TYPE_CUDA: nvmlFBCSessionType_enum = 2;
pub const nvmlFBCSessionType_enum_NVML_FBC_SESSION_TYPE_VID: nvmlFBCSessionType_enum = 3;
pub const nvmlFBCSessionType_enum_NVML_FBC_SESSION_TYPE_HWENC: nvmlFBCSessionType_enum = 4;
pub type nvmlFBCSessionType_enum = raw::c_uint;
pub use self::nvmlFBCSessionType_enum as nvmlFBCSessionType_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nvmlFBCStats_st {
    pub sessionsCount: raw::c_uint,
    pub averageFPS: raw::c_uint,
    pub averageLatency: raw::c_uint,
}
#[test]
fn bindgen_test_layout_nvmlFBCStats_st() {
    assert_eq!(
        ::std::mem::size_of::<nvmlFBCStats_st>(),
        12usize,
        concat!("Size of: ", stringify!(nvmlFBCStats_st))
    );
    assert_eq!(
        ::std::mem::align_of::<nvmlFBCStats_st>(),
        4usize,
        concat!("Alignment of ", stringify!(nvmlFBCStats_st))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlFBCStats_st>())).sessionsCount as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlFBCStats_st),
            "::",
            stringify!(sessionsCount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlFBCStats_st>())).averageFPS as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlFBCStats_st),
            "::",
            stringify!(averageFPS)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlFBCStats_st>())).averageLatency as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlFBCStats_st),
            "::",
            stringify!(averageLatency)
        )
    );
}
pub type nvmlFBCStats_t = nvmlFBCStats_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nvmlFBCSessionInfo_st {
    pub sessionId: raw::c_uint,
    pub pid: raw::c_uint,
    pub vgpuInstance: nvmlVgpuInstance_t,
    pub displayOrdinal: raw::c_uint,
    pub sessionType: nvmlFBCSessionType_t,
    pub sessionFlags: raw::c_uint,
    pub hMaxResolution: raw::c_uint,
    pub vMaxResolution: raw::c_uint,
    pub hResolution: raw::c_uint,
    pub vResolution: raw::c_uint,
    pub averageFPS: raw::c_uint,
    pub averageLatency: raw::c_uint,
}
#[test]
fn bindgen_test_layout_nvmlFBCSessionInfo_st() {
    assert_eq!(
        ::std::mem::size_of::<nvmlFBCSessionInfo_st>(),
        48usize,
        concat!("Size of: ", stringify!(nvmlFBCSessionInfo_st))
    );
    assert_eq!(
        ::std::mem::align_of::<nvmlFBCSessionInfo_st>(),
        4usize,
        concat!("Alignment of ", stringify!(nvmlFBCSessionInfo_st))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlFBCSessionInfo_st>())).sessionId as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlFBCSessionInfo_st),
            "::",
            stringify!(sessionId)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlFBCSessionInfo_st>())).pid as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlFBCSessionInfo_st),
            "::",
            stringify!(pid)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlFBCSessionInfo_st>())).vgpuInstance as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlFBCSessionInfo_st),
            "::",
            stringify!(vgpuInstance)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlFBCSessionInfo_st>())).displayOrdinal as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlFBCSessionInfo_st),
            "::",
            stringify!(displayOrdinal)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlFBCSessionInfo_st>())).sessionType as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlFBCSessionInfo_st),
            "::",
            stringify!(sessionType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlFBCSessionInfo_st>())).sessionFlags as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlFBCSessionInfo_st),
            "::",
            stringify!(sessionFlags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlFBCSessionInfo_st>())).hMaxResolution as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlFBCSessionInfo_st),
            "::",
            stringify!(hMaxResolution)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlFBCSessionInfo_st>())).vMaxResolution as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlFBCSessionInfo_st),
            "::",
            stringify!(vMaxResolution)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlFBCSessionInfo_st>())).hResolution as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlFBCSessionInfo_st),
            "::",
            stringify!(hResolution)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlFBCSessionInfo_st>())).vResolution as *const _ as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlFBCSessionInfo_st),
            "::",
            stringify!(vResolution)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlFBCSessionInfo_st>())).averageFPS as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlFBCSessionInfo_st),
            "::",
            stringify!(averageFPS)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlFBCSessionInfo_st>())).averageLatency as *const _ as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlFBCSessionInfo_st),
            "::",
            stringify!(averageLatency)
        )
    );
}
pub type nvmlFBCSessionInfo_t = nvmlFBCSessionInfo_st;
pub const nvmlDetachGpuState_enum_NVML_DETACH_GPU_KEEP: nvmlDetachGpuState_enum = 0;
pub const nvmlDetachGpuState_enum_NVML_DETACH_GPU_REMOVE: nvmlDetachGpuState_enum = 1;
pub type nvmlDetachGpuState_enum = raw::c_uint;
pub use self::nvmlDetachGpuState_enum as nvmlDetachGpuState_t;
pub const nvmlPcieLinkState_enum_NVML_PCIE_LINK_KEEP: nvmlPcieLinkState_enum = 0;
pub const nvmlPcieLinkState_enum_NVML_PCIE_LINK_SHUT_DOWN: nvmlPcieLinkState_enum = 1;
pub type nvmlPcieLinkState_enum = raw::c_uint;
pub use self::nvmlPcieLinkState_enum as nvmlPcieLinkState_t;
pub type nvmlAffinityScope_t = raw::c_uint;
pub const nvmlClockLimitId_enum_NVML_CLOCK_LIMIT_ID_RANGE_START: nvmlClockLimitId_enum = 4294967040;
pub const nvmlClockLimitId_enum_NVML_CLOCK_LIMIT_ID_TDP: nvmlClockLimitId_enum = 4294967041;
pub const nvmlClockLimitId_enum_NVML_CLOCK_LIMIT_ID_UNLIMITED: nvmlClockLimitId_enum = 4294967042;
pub type nvmlClockLimitId_enum = raw::c_uint;
pub use self::nvmlClockLimitId_enum as nvmlClockLimitId_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nvmlVgpuVersion_st {
    pub minVersion: raw::c_uint,
    pub maxVersion: raw::c_uint,
}
#[test]
fn bindgen_test_layout_nvmlVgpuVersion_st() {
    assert_eq!(
        ::std::mem::size_of::<nvmlVgpuVersion_st>(),
        8usize,
        concat!("Size of: ", stringify!(nvmlVgpuVersion_st))
    );
    assert_eq!(
        ::std::mem::align_of::<nvmlVgpuVersion_st>(),
        4usize,
        concat!("Alignment of ", stringify!(nvmlVgpuVersion_st))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlVgpuVersion_st>())).minVersion as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlVgpuVersion_st),
            "::",
            stringify!(minVersion)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlVgpuVersion_st>())).maxVersion as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlVgpuVersion_st),
            "::",
            stringify!(maxVersion)
        )
    );
}
pub type nvmlVgpuVersion_t = nvmlVgpuVersion_st;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct nvmlVgpuMetadata_st {
    pub version: raw::c_uint,
    pub revision: raw::c_uint,
    pub guestInfoState: nvmlVgpuGuestInfoState_t,
    pub guestDriverVersion: [raw::c_char; 80usize],
    pub hostDriverVersion: [raw::c_char; 80usize],
    pub reserved: [raw::c_uint; 6usize],
    pub vgpuVirtualizationCaps: raw::c_uint,
    pub guestVgpuVersion: raw::c_uint,
    pub opaqueDataSize: raw::c_uint,
    pub opaqueData: [raw::c_char; 4usize],
}
#[test]
fn bindgen_test_layout_nvmlVgpuMetadata_st() {
    assert_eq!(
        ::std::mem::size_of::<nvmlVgpuMetadata_st>(),
        212usize,
        concat!("Size of: ", stringify!(nvmlVgpuMetadata_st))
    );
    assert_eq!(
        ::std::mem::align_of::<nvmlVgpuMetadata_st>(),
        4usize,
        concat!("Alignment of ", stringify!(nvmlVgpuMetadata_st))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlVgpuMetadata_st>())).version as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlVgpuMetadata_st),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlVgpuMetadata_st>())).revision as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlVgpuMetadata_st),
            "::",
            stringify!(revision)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlVgpuMetadata_st>())).guestInfoState as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlVgpuMetadata_st),
            "::",
            stringify!(guestInfoState)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlVgpuMetadata_st>())).guestDriverVersion as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlVgpuMetadata_st),
            "::",
            stringify!(guestDriverVersion)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlVgpuMetadata_st>())).hostDriverVersion as *const _ as usize
        },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlVgpuMetadata_st),
            "::",
            stringify!(hostDriverVersion)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlVgpuMetadata_st>())).reserved as *const _ as usize },
        172usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlVgpuMetadata_st),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlVgpuMetadata_st>())).vgpuVirtualizationCaps as *const _
                as usize
        },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlVgpuMetadata_st),
            "::",
            stringify!(vgpuVirtualizationCaps)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlVgpuMetadata_st>())).guestVgpuVersion as *const _ as usize
        },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlVgpuMetadata_st),
            "::",
            stringify!(guestVgpuVersion)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlVgpuMetadata_st>())).opaqueDataSize as *const _ as usize
        },
        204usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlVgpuMetadata_st),
            "::",
            stringify!(opaqueDataSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlVgpuMetadata_st>())).opaqueData as *const _ as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlVgpuMetadata_st),
            "::",
            stringify!(opaqueData)
        )
    );
}
pub type nvmlVgpuMetadata_t = nvmlVgpuMetadata_st;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct nvmlVgpuPgpuMetadata_st {
    pub version: raw::c_uint,
    pub revision: raw::c_uint,
    pub hostDriverVersion: [raw::c_char; 80usize],
    pub pgpuVirtualizationCaps: raw::c_uint,
    pub reserved: [raw::c_uint; 5usize],
    pub hostSupportedVgpuRange: nvmlVgpuVersion_t,
    pub opaqueDataSize: raw::c_uint,
    pub opaqueData: [raw::c_char; 4usize],
}
#[test]
fn bindgen_test_layout_nvmlVgpuPgpuMetadata_st() {
    assert_eq!(
        ::std::mem::size_of::<nvmlVgpuPgpuMetadata_st>(),
        128usize,
        concat!("Size of: ", stringify!(nvmlVgpuPgpuMetadata_st))
    );
    assert_eq!(
        ::std::mem::align_of::<nvmlVgpuPgpuMetadata_st>(),
        4usize,
        concat!("Alignment of ", stringify!(nvmlVgpuPgpuMetadata_st))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlVgpuPgpuMetadata_st>())).version as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlVgpuPgpuMetadata_st),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlVgpuPgpuMetadata_st>())).revision as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlVgpuPgpuMetadata_st),
            "::",
            stringify!(revision)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlVgpuPgpuMetadata_st>())).hostDriverVersion as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlVgpuPgpuMetadata_st),
            "::",
            stringify!(hostDriverVersion)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlVgpuPgpuMetadata_st>())).pgpuVirtualizationCaps as *const _
                as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlVgpuPgpuMetadata_st),
            "::",
            stringify!(pgpuVirtualizationCaps)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlVgpuPgpuMetadata_st>())).reserved as *const _ as usize
        },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlVgpuPgpuMetadata_st),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlVgpuPgpuMetadata_st>())).hostSupportedVgpuRange as *const _
                as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlVgpuPgpuMetadata_st),
            "::",
            stringify!(hostSupportedVgpuRange)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlVgpuPgpuMetadata_st>())).opaqueDataSize as *const _ as usize
        },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlVgpuPgpuMetadata_st),
            "::",
            stringify!(opaqueDataSize)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlVgpuPgpuMetadata_st>())).opaqueData as *const _ as usize
        },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlVgpuPgpuMetadata_st),
            "::",
            stringify!(opaqueData)
        )
    );
}
pub type nvmlVgpuPgpuMetadata_t = nvmlVgpuPgpuMetadata_st;
pub const nvmlVgpuVmCompatibility_enum_NVML_VGPU_VM_COMPATIBILITY_NONE:
    nvmlVgpuVmCompatibility_enum = 0;
pub const nvmlVgpuVmCompatibility_enum_NVML_VGPU_VM_COMPATIBILITY_COLD:
    nvmlVgpuVmCompatibility_enum = 1;
pub const nvmlVgpuVmCompatibility_enum_NVML_VGPU_VM_COMPATIBILITY_HIBERNATE:
    nvmlVgpuVmCompatibility_enum = 2;
pub const nvmlVgpuVmCompatibility_enum_NVML_VGPU_VM_COMPATIBILITY_SLEEP:
    nvmlVgpuVmCompatibility_enum = 4;
pub const nvmlVgpuVmCompatibility_enum_NVML_VGPU_VM_COMPATIBILITY_LIVE:
    nvmlVgpuVmCompatibility_enum = 8;
pub type nvmlVgpuVmCompatibility_enum = raw::c_uint;
pub use self::nvmlVgpuVmCompatibility_enum as nvmlVgpuVmCompatibility_t;
pub const nvmlVgpuPgpuCompatibilityLimitCode_enum_NVML_VGPU_COMPATIBILITY_LIMIT_NONE:
    nvmlVgpuPgpuCompatibilityLimitCode_enum = 0;
pub const nvmlVgpuPgpuCompatibilityLimitCode_enum_NVML_VGPU_COMPATIBILITY_LIMIT_HOST_DRIVER:
    nvmlVgpuPgpuCompatibilityLimitCode_enum = 1;
pub const nvmlVgpuPgpuCompatibilityLimitCode_enum_NVML_VGPU_COMPATIBILITY_LIMIT_GUEST_DRIVER:
    nvmlVgpuPgpuCompatibilityLimitCode_enum = 2;
pub const nvmlVgpuPgpuCompatibilityLimitCode_enum_NVML_VGPU_COMPATIBILITY_LIMIT_GPU:
    nvmlVgpuPgpuCompatibilityLimitCode_enum = 4;
pub const nvmlVgpuPgpuCompatibilityLimitCode_enum_NVML_VGPU_COMPATIBILITY_LIMIT_OTHER:
    nvmlVgpuPgpuCompatibilityLimitCode_enum = 2147483648;
pub type nvmlVgpuPgpuCompatibilityLimitCode_enum = raw::c_uint;
pub use self::nvmlVgpuPgpuCompatibilityLimitCode_enum as nvmlVgpuPgpuCompatibilityLimitCode_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nvmlVgpuPgpuCompatibility_st {
    pub vgpuVmCompatibility: nvmlVgpuVmCompatibility_t,
    pub compatibilityLimitCode: nvmlVgpuPgpuCompatibilityLimitCode_t,
}
#[test]
fn bindgen_test_layout_nvmlVgpuPgpuCompatibility_st() {
    assert_eq!(
        ::std::mem::size_of::<nvmlVgpuPgpuCompatibility_st>(),
        8usize,
        concat!("Size of: ", stringify!(nvmlVgpuPgpuCompatibility_st))
    );
    assert_eq!(
        ::std::mem::align_of::<nvmlVgpuPgpuCompatibility_st>(),
        4usize,
        concat!("Alignment of ", stringify!(nvmlVgpuPgpuCompatibility_st))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlVgpuPgpuCompatibility_st>())).vgpuVmCompatibility as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlVgpuPgpuCompatibility_st),
            "::",
            stringify!(vgpuVmCompatibility)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlVgpuPgpuCompatibility_st>())).compatibilityLimitCode
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlVgpuPgpuCompatibility_st),
            "::",
            stringify!(compatibilityLimitCode)
        )
    );
}
pub type nvmlVgpuPgpuCompatibility_t = nvmlVgpuPgpuCompatibility_st;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct nvmlBlacklistDeviceInfo_st {
    pub pciInfo: nvmlPciInfo_t,
    pub uuid: [raw::c_char; 80usize],
}
#[test]
fn bindgen_test_layout_nvmlBlacklistDeviceInfo_st() {
    assert_eq!(
        ::std::mem::size_of::<nvmlBlacklistDeviceInfo_st>(),
        148usize,
        concat!("Size of: ", stringify!(nvmlBlacklistDeviceInfo_st))
    );
    assert_eq!(
        ::std::mem::align_of::<nvmlBlacklistDeviceInfo_st>(),
        4usize,
        concat!("Alignment of ", stringify!(nvmlBlacklistDeviceInfo_st))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlBlacklistDeviceInfo_st>())).pciInfo as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlBlacklistDeviceInfo_st),
            "::",
            stringify!(pciInfo)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlBlacklistDeviceInfo_st>())).uuid as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlBlacklistDeviceInfo_st),
            "::",
            stringify!(uuid)
        )
    );
}
pub type nvmlBlacklistDeviceInfo_t = nvmlBlacklistDeviceInfo_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nvmlGpuInstancePlacement_st {
    pub start: raw::c_uint,
    pub size: raw::c_uint,
}
#[test]
fn bindgen_test_layout_nvmlGpuInstancePlacement_st() {
    assert_eq!(
        ::std::mem::size_of::<nvmlGpuInstancePlacement_st>(),
        8usize,
        concat!("Size of: ", stringify!(nvmlGpuInstancePlacement_st))
    );
    assert_eq!(
        ::std::mem::align_of::<nvmlGpuInstancePlacement_st>(),
        4usize,
        concat!("Alignment of ", stringify!(nvmlGpuInstancePlacement_st))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlGpuInstancePlacement_st>())).start as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlGpuInstancePlacement_st),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlGpuInstancePlacement_st>())).size as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlGpuInstancePlacement_st),
            "::",
            stringify!(size)
        )
    );
}
pub type nvmlGpuInstancePlacement_t = nvmlGpuInstancePlacement_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nvmlGpuInstanceProfileInfo_st {
    pub id: raw::c_uint,
    pub isP2pSupported: raw::c_uint,
    pub sliceCount: raw::c_uint,
    pub instanceCount: raw::c_uint,
    pub multiprocessorCount: raw::c_uint,
    pub copyEngineCount: raw::c_uint,
    pub decoderCount: raw::c_uint,
    pub encoderCount: raw::c_uint,
    pub jpegCount: raw::c_uint,
    pub ofaCount: raw::c_uint,
    pub memorySizeMB: raw::c_ulonglong,
}
#[test]
fn bindgen_test_layout_nvmlGpuInstanceProfileInfo_st() {
    assert_eq!(
        ::std::mem::size_of::<nvmlGpuInstanceProfileInfo_st>(),
        48usize,
        concat!("Size of: ", stringify!(nvmlGpuInstanceProfileInfo_st))
    );
    assert_eq!(
        ::std::mem::align_of::<nvmlGpuInstanceProfileInfo_st>(),
        8usize,
        concat!("Alignment of ", stringify!(nvmlGpuInstanceProfileInfo_st))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlGpuInstanceProfileInfo_st>())).id as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlGpuInstanceProfileInfo_st),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlGpuInstanceProfileInfo_st>())).isP2pSupported as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlGpuInstanceProfileInfo_st),
            "::",
            stringify!(isP2pSupported)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlGpuInstanceProfileInfo_st>())).sliceCount as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlGpuInstanceProfileInfo_st),
            "::",
            stringify!(sliceCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlGpuInstanceProfileInfo_st>())).instanceCount as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlGpuInstanceProfileInfo_st),
            "::",
            stringify!(instanceCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlGpuInstanceProfileInfo_st>())).multiprocessorCount
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlGpuInstanceProfileInfo_st),
            "::",
            stringify!(multiprocessorCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlGpuInstanceProfileInfo_st>())).copyEngineCount as *const _
                as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlGpuInstanceProfileInfo_st),
            "::",
            stringify!(copyEngineCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlGpuInstanceProfileInfo_st>())).decoderCount as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlGpuInstanceProfileInfo_st),
            "::",
            stringify!(decoderCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlGpuInstanceProfileInfo_st>())).encoderCount as *const _
                as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlGpuInstanceProfileInfo_st),
            "::",
            stringify!(encoderCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlGpuInstanceProfileInfo_st>())).jpegCount as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlGpuInstanceProfileInfo_st),
            "::",
            stringify!(jpegCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlGpuInstanceProfileInfo_st>())).ofaCount as *const _ as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlGpuInstanceProfileInfo_st),
            "::",
            stringify!(ofaCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlGpuInstanceProfileInfo_st>())).memorySizeMB as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlGpuInstanceProfileInfo_st),
            "::",
            stringify!(memorySizeMB)
        )
    );
}
pub type nvmlGpuInstanceProfileInfo_t = nvmlGpuInstanceProfileInfo_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nvmlGpuInstanceInfo_st {
    pub device: nvmlDevice_t,
    pub id: raw::c_uint,
    pub profileId: raw::c_uint,
    pub placement: nvmlGpuInstancePlacement_t,
}
#[test]
fn bindgen_test_layout_nvmlGpuInstanceInfo_st() {
    assert_eq!(
        ::std::mem::size_of::<nvmlGpuInstanceInfo_st>(),
        24usize,
        concat!("Size of: ", stringify!(nvmlGpuInstanceInfo_st))
    );
    assert_eq!(
        ::std::mem::align_of::<nvmlGpuInstanceInfo_st>(),
        8usize,
        concat!("Alignment of ", stringify!(nvmlGpuInstanceInfo_st))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlGpuInstanceInfo_st>())).device as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlGpuInstanceInfo_st),
            "::",
            stringify!(device)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlGpuInstanceInfo_st>())).id as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlGpuInstanceInfo_st),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlGpuInstanceInfo_st>())).profileId as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlGpuInstanceInfo_st),
            "::",
            stringify!(profileId)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlGpuInstanceInfo_st>())).placement as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlGpuInstanceInfo_st),
            "::",
            stringify!(placement)
        )
    );
}
pub type nvmlGpuInstanceInfo_t = nvmlGpuInstanceInfo_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nvmlGpuInstance_st {
    _unused: [u8; 0],
}
pub type nvmlGpuInstance_t = *mut nvmlGpuInstance_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nvmlComputeInstancePlacement_st {
    pub start: raw::c_uint,
    pub size: raw::c_uint,
}
#[test]
fn bindgen_test_layout_nvmlComputeInstancePlacement_st() {
    assert_eq!(
        ::std::mem::size_of::<nvmlComputeInstancePlacement_st>(),
        8usize,
        concat!("Size of: ", stringify!(nvmlComputeInstancePlacement_st))
    );
    assert_eq!(
        ::std::mem::align_of::<nvmlComputeInstancePlacement_st>(),
        4usize,
        concat!("Alignment of ", stringify!(nvmlComputeInstancePlacement_st))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlComputeInstancePlacement_st>())).start as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlComputeInstancePlacement_st),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlComputeInstancePlacement_st>())).size as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlComputeInstancePlacement_st),
            "::",
            stringify!(size)
        )
    );
}
pub type nvmlComputeInstancePlacement_t = nvmlComputeInstancePlacement_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nvmlComputeInstanceProfileInfo_st {
    pub id: raw::c_uint,
    pub sliceCount: raw::c_uint,
    pub instanceCount: raw::c_uint,
    pub multiprocessorCount: raw::c_uint,
    pub sharedCopyEngineCount: raw::c_uint,
    pub sharedDecoderCount: raw::c_uint,
    pub sharedEncoderCount: raw::c_uint,
    pub sharedJpegCount: raw::c_uint,
    pub sharedOfaCount: raw::c_uint,
}
#[test]
fn bindgen_test_layout_nvmlComputeInstanceProfileInfo_st() {
    assert_eq!(
        ::std::mem::size_of::<nvmlComputeInstanceProfileInfo_st>(),
        36usize,
        concat!("Size of: ", stringify!(nvmlComputeInstanceProfileInfo_st))
    );
    assert_eq!(
        ::std::mem::align_of::<nvmlComputeInstanceProfileInfo_st>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(nvmlComputeInstanceProfileInfo_st)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlComputeInstanceProfileInfo_st>())).id as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlComputeInstanceProfileInfo_st),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlComputeInstanceProfileInfo_st>())).sliceCount as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlComputeInstanceProfileInfo_st),
            "::",
            stringify!(sliceCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlComputeInstanceProfileInfo_st>())).instanceCount as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlComputeInstanceProfileInfo_st),
            "::",
            stringify!(instanceCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlComputeInstanceProfileInfo_st>())).multiprocessorCount
                as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlComputeInstanceProfileInfo_st),
            "::",
            stringify!(multiprocessorCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlComputeInstanceProfileInfo_st>())).sharedCopyEngineCount
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlComputeInstanceProfileInfo_st),
            "::",
            stringify!(sharedCopyEngineCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlComputeInstanceProfileInfo_st>())).sharedDecoderCount
                as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlComputeInstanceProfileInfo_st),
            "::",
            stringify!(sharedDecoderCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlComputeInstanceProfileInfo_st>())).sharedEncoderCount
                as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlComputeInstanceProfileInfo_st),
            "::",
            stringify!(sharedEncoderCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlComputeInstanceProfileInfo_st>())).sharedJpegCount
                as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlComputeInstanceProfileInfo_st),
            "::",
            stringify!(sharedJpegCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlComputeInstanceProfileInfo_st>())).sharedOfaCount as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlComputeInstanceProfileInfo_st),
            "::",
            stringify!(sharedOfaCount)
        )
    );
}
pub type nvmlComputeInstanceProfileInfo_t = nvmlComputeInstanceProfileInfo_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nvmlComputeInstanceInfo_st {
    pub device: nvmlDevice_t,
    pub gpuInstance: nvmlGpuInstance_t,
    pub id: raw::c_uint,
    pub profileId: raw::c_uint,
    pub placement: nvmlComputeInstancePlacement_t,
}
#[test]
fn bindgen_test_layout_nvmlComputeInstanceInfo_st() {
    assert_eq!(
        ::std::mem::size_of::<nvmlComputeInstanceInfo_st>(),
        32usize,
        concat!("Size of: ", stringify!(nvmlComputeInstanceInfo_st))
    );
    assert_eq!(
        ::std::mem::align_of::<nvmlComputeInstanceInfo_st>(),
        8usize,
        concat!("Alignment of ", stringify!(nvmlComputeInstanceInfo_st))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlComputeInstanceInfo_st>())).device as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlComputeInstanceInfo_st),
            "::",
            stringify!(device)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlComputeInstanceInfo_st>())).gpuInstance as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlComputeInstanceInfo_st),
            "::",
            stringify!(gpuInstance)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvmlComputeInstanceInfo_st>())).id as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlComputeInstanceInfo_st),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlComputeInstanceInfo_st>())).profileId as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlComputeInstanceInfo_st),
            "::",
            stringify!(profileId)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nvmlComputeInstanceInfo_st>())).placement as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(nvmlComputeInstanceInfo_st),
            "::",
            stringify!(placement)
        )
    );
}
pub type nvmlComputeInstanceInfo_t = nvmlComputeInstanceInfo_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nvmlComputeInstance_st {
    _unused: [u8; 0],
}
pub type nvmlComputeInstance_t = *mut nvmlComputeInstance_st;
extern crate libloading;
pub struct nvml {
    __library: ::libloading::Library,
    pub nvmlInit_v2: Result<unsafe extern "C" fn() -> nvmlReturn_t, ::libloading::Error>,
    pub nvmlInitWithFlags:
        Result<unsafe extern "C" fn(flags: raw::c_uint) -> nvmlReturn_t, ::libloading::Error>,
    pub nvmlShutdown: Result<unsafe extern "C" fn() -> nvmlReturn_t, ::libloading::Error>,
    pub nvmlErrorString: Result<
        unsafe extern "C" fn(result: nvmlReturn_t) -> *const raw::c_char,
        ::libloading::Error,
    >,
    pub nvmlSystemGetDriverVersion: Result<
